{"status":"success","data":{"bookName":"syll","word_data":"{\"\\\"-1\\\"\":\"\\\"\\\"\",\"\\\"0\\\"\":\"\\\" V SEMESTER  B.E - COMPUTER SCEINCE AND ENGINEERING  Scheme of Teaching and Examination (Autonomous Scheme)  Sl. No Subject Code Course Title Teaching Dept. Contact Hours / Week Credits L T* P* Total 1 CS0407 Data Communication and Networking CS & E 4 0 0 4 4 2 CS0413 Operating Systems CS & E 4 0 0 4 4 3 CS0414 Database Management Systems CS & E 4 0 0 4 4 4 CS0512 System Software CS & E 4 2 0 6 5 5 CS0424 Management and Entrepreneurship CS & E 4 0 0 4 4 6 CS------ Elective – I (GROUP 1 MOOC) CS & E 3 0 0 3 3 7 CS0106 Microprocessor Interfacing Laboratory CS & E 0 0 3 3 1.5 8 CS0107 Database Laboratory CS & E 0 0 3 3 1.5 TOTAL 31 27  * 1 Hour = 0.5 Credits  Pattern of course evaluation for both CIE and SEE will be mentioned in the abridged lesson plan and the Course Instructor (CI) will discuss the same with the students during the first/second session of the semester. \\\"\",\"\\\"1\\\"\":\"\\\"VI SEMESTER  B.E - COMPUTER SCEINCE AND ENGINEERING  Scheme of Teaching and Examination (Autonomous Scheme)  Sl. No Subject Code Course Title Teaching Dept Contact Hours / Week Credits L T* P* Total 1 CS0418 Computer Networks CS & E 4 0 0 4 4 2 CS0523 Object Oriented Modeling and Design CS & E 4 2 0 6 5 3 CS0425 Compiler Design CS & E 4 0 0 4 4 4 CS0450 Web Technologies and Applications CS & E 4 0 0 4 4 5 CS----- Elective – II (GROUP 2) CS & E 3 0 0 3 3 6 CS----- Elective – III (GROUP 3) CS & E 3 0 0 3 3 7 CS0112 Web Technologies and Applications laboratory CS & E 0 0 3 3 1.5 8 CS0109 Computer Networking Laboratory CS & E 0 0 3 3 1.5 TOTAL 31 26 * 1 Hour = 0.5 Credits  Pattern of course evaluation for both CIE and SEE will be mentioned in the abridged lesson plan and the Course Instructor (CI) will discuss the same with the students during the first        \\\"\",\"\\\"2\\\"\":\"\\\" BLOWN-UP SYLLABUS - V SEMESTER   DATA COMMUNICATIONS AND NETWORKING (4:0:0)  Sub code : CS0407 CIE : 50 % Hours / week : 04 SEE : 50 % SEE Hours : 3 Hours Max. Marks : 100  Course Outcome  On successful completion of the course the students will be able to 1. Describe the basic concepts of data communication networks internet OSI and TCP/IP models 2. Understand the digital conversion techniques different transmission modes and transmission media. 3. Analyze the different functionalities of data link layer and examine error detection and correction codes used 4. Categorize the different data link layer protocols and media access control protocols 5. Discuss the IEEE standards for wired and wireless LANs 6. Discuss the current wireless networks and understand the various connecting device usage  UNIT 1  Introduction: Data Communications Networks Network types Internet history Standards and administration. Network Models: Protocol layering TCP/IP Protocol suite the OSI Model. Introduction to Physical Layer: Data and Signals Periodic Analog Signals Digital Signals Data rate limits.  SLE: Transmission impairment Performance. 9 Hours  UNIT 2  Digital Transmission: Digital-to-Digital conversion Analog-to-Digital conversion. Transmission Modes.Bandwidth utilization: Multiplexing Spread Spectrum. Transmission Media: Guided media – Twisted Pair Coaxial Cable Fibre Optic Cable Unguided media – Radio waves Microwaves.  SLE: Infrared transmission 9 Hours  UNIT 3  Introduction to Data Link Layer: Introduction Link-layer addressing. Error Detection and Correction: Introduction Block coding cyclic codes Forward Error Correction.  SLE: Checksum. 8 Hours  UNIT 4  Data Link Control: DLC Services DLL Protocols HDLC PPP – Services Framing Transition Phases. Media Access Control: Random Access Controlled Access Channelization.  SLE: PPP – Multiplexing 9 Hours  \\\"\",\"\\\"3\\\"\":\"\\\"UNIT 5  Wired LANs: Ethernet Protocol Standard Ethernet. Wireless LANs: Introduction IEEE 802.11 Project Bluetooth.  SLE: Fast Ethernet Gigabit Ethernet. 9 Hours  UNIT 6  Other Wireless Networks: WiMAX Cellular Telephony Satellite Networks – Operation GEO Satellites Connection Of LANs: Connecting Devices Virtual LANS  SLE: MEO and LEO Satellites 8 Hours  TEXT BOOK:  1. Data Communications And Networking by BehrouzForouzan Fifth Edition McGraw Hill Education (India) Pvt. Ltd. 2013.  REFERENCE BOOK:  1. Communication Networks by Alberto Leon-Garcia and IndraWidjaja Second Edition Tata McGraw Hill Publications.                               \\\"\",\"\\\"4\\\"\":\"\\\"OPERATING SYSTEMS (4:0:0)  Sub code : CS0413  CIE : 50 % Hrs / week : 04 SEE : 50 % SEE Hrs : 3 Hrs Max. Marks : 100 Course Outcomes  On successful completion of the course the students will be able to 1. Analyze the mechanisms of Operating Systems to handle processes and threads and their communication 2. Identify the issues and various solutions for inter-process communication 3. Understand the different approaches to memory management. 4. Identify the design and implementation issues in virtual memory management 5. Explain the concepts of file system and its implementation 6. Explain the concepts of deadlock and analyze how they can be managed / avoided  UNIT 1  INTRODUCTION PROCESSES AND THREADS: WHAT IS AN OPERATING SYSTEM? : The Operating system as an extended machine The Operating system as a resource manager. PROCESSES: The process model Process creation Process termination Process hierarchies Process states. THREADS: The thread model Thread usage implementing threads in user space implementing threads in the kernel Hybrid implementations Scheduler activations. SCHEDULING: Introduction to scheduling Scheduling in batch Systems Scheduling in interactive systems.  SLE: Thread scheduling 9 Hours   UNIT 2  INTERPROCESS COMMUNICATION Race conditions Critical regions Mutual exclusion with busy waiting Sleep and wakeup Semaphores Mutexes CLASSICAL IPC PROBLEMS: The dining philosophers problem The readers and writers problem. Memory Management: No Memory Abstraction A Memory Abstraction: Address Spaces - The Notion of an Address Space Swapping Managing Free Memory.  SLE: Barriers 8 Hours  UNIT 3 MEMORY MANAGEMENT PAGE REPLACEMENT ALGORITHMS & DESIGN ISSUES: Virtual Memory: Paging Page Tables Speeding Up Paging Page Tables for large memories. PAGE REPLACEMENT ALGORITHMS: The optimal page replacement algorithm The not recently used page replacement algorithm The first-in first-out The second chance page replacement algorithm The clock page replacement algorithm The least recently used  SLE: Comparison of Page Replacement Algorithms 9 Hours  \\\"\",\"\\\"5\\\"\":\"\\\"UNIT 4  DESIGN ISSUES FOR PAGING SYSTEMS: Local versus Global allocation policies Load control Page size Separate instruction and data spaces Shared pages Virtual memory interface. IMPLEMENTATION ISSUES: Operating system involvement with paging Page fault handling Instruction backup locking pages in memory Backing store SEGMENTATION: Implementation of pure segmentation Segmentation with paging:Multics.  SLE: Separation of policy and mechanism. 8 Hours  UNIT 5  INPUT/OUTPUT: I/O SOFTWARE LAYERS: Interrupt handlers Device drivers Device-Independent I/O software. FILE SYSTEMS: DIRECTORIES: Single-Level directory systems Hierarchical directory systems FILE SYSTEM IMPLEMENTATION: File system layout implementing files Implementing directories Shared files Log-Structured file systems Disk space management File system performance.  SLE: Defragmenting Disks 9 Hours  UNIT 6  DEADLOCKS: INTRODUCTION TO DEADLOCKS: Conditions for deadlock Deadlock modeling. THE OSTRICH ALGORITHM DEADLOCK DETECTION AND RECOVERY: Deadlock detection with one resource of each type Deadlock detection with multiple resource of each type Recovery from deadlock DEADLOCK AVOIDANCE: Resource trajectories Safe and Unsafe States The Banker’s algorithm for a single resource The banker’s algorithm for multiple resources DEADLOCK PREVENTION: Attacking the mutual exclusion condition Attacking the Hold and Wait condition Attacking the No Preemption condition.  SLE: Attacking the Circular Wait condition 9 Hours   TEXT BOOK:  1. Modern operating systems 4th /E Tanenbaum A. PHI / Pearson Edition Asia 2001.  REFERENCE BOOKS:  1. Operating Systems William Stallings PHI Fourth Edition 2. Operating System Principles – Abraham Silberschatz Peter Baer Galvin Greg Gagne Wiley-India 7th edition 2006. 3. Operating Systems Milan Kovic Tata McGraw Hill 2001. 4. Operating System Design: v. 1: The Xinu Approach (Prentice-hall Software) Douglas Comer. 5. TUNIX Operating Systems: A Practical Approach Robert Switzer Prentice-Hall 1993.   \\\"\",\"\\\"6\\\"\":\"\\\"  DATABASE MANAGEMENT SYSTEMS (4:0:0)  Sub code : CS0414 CIE : 50 % Hrs / week : 04 SEE : 50 % SEE Hrs : 03 Hrs Max. Marks : 100  Prerequisite: File Systems  Course Outcome:  On successful completion of the course the students will be able to 1. Describe different database models and creation of MySQL database. 2. Design the database using Entity Relationship model and Normalization. 3. Write the SQL query to interact with the database and illustrate transaction concepts. 4. Create triggers constraints and objects in MySQL. 5. Demonstrate the use of Indexes and Views. 6. Differentiate different types of failures and recovery techniques.  UNIT 1  Introduction: Advantages of using a DBMS approaches Definition of schema data model and instances Three-schema architecture and data independence Different Database Models Interfacingwith a Database The Mechanics Disk versus Main-Memory An Example Database: The Everest Books Database Relational Databases (with a MySQL Flavor): MySQL Database System DatabaseOrganization Creating and using the Database  SLE: Steps in Designing a Database. 9 Hours  UNIT 2  Manipulating the Database: Example Tables Relational Algebra. Database Design 1: The Entity-Relationship Model- Entity Entity Sets Attributes Relationships Constraints on Relationship types Weak entity type Notations for ER Diagrams Modeling The Everest Books’ Database Database Design 2: Definition of Functional Dependencies Normal Forms Based on Primary Keys - 1NF 2NF 3NF BCNF  SLE: Ad Hoc Database Design 9 Hours UNIT 3 SQL: Basics Data Definition Language Data Manipulation Language Stored Routines Formatting and SQL. Transactions: Informally Speaking Transactions in SQL Transaction Semantics Serializability Locks \\\"\",\"\\\"7\\\"\":\"\\\"SQL Isolation Levels Transactions in MySQL  SLE: Orders Invoices & Reports 8 Hours  UNIT 4  Constraints: Constraints in SQL Constraint Check Time. Triggers: Triggers in SQL. Objects: Objects in SQL Referencing Objects  SLE: Comparing Objects. 9 Hours  UNIT 5  Indexes: How does an Index Work? Types of Indexes Different Types of Indexes HashIndexes Indexes in MySQL Views: Two Implementations of Views Views in MySQL Examples.  SLE: Some Thoughts on Indexing. 9 Hours  UNIT 6  Spatial Databases: MySQL Example Logs and Recovery: Failure Types Logs Log Details Some Log Characteristics Database Recovery Database Recovery Example MySQL.  SLE: Spatial Databases: Example 8 Hours   TEXT BOOKS:  1. The Database Book: Principles and Practice using MySQL Narain Gehani Universities Press(India) Private Limited 2008. 2. Fundamentals of Database Systems Elmasri and Navathe Addison-Wesley 5thEdition 2007.   REFERENCE BOOKS:  1. Database Management Systems Raghu Ramakrishnan and Johannes Gehrke McGraw-Hill 3rd Edition 2003. 2. Silberschatz Korth and Sudharshan: Database System Concepts 6th Edition McGrawHill 2010.   \\\"\",\"\\\"8\\\"\":\"\\\"SYSTEM SOFTWARE (4:2:0)  Sub code : CS0512 CIE : 50 % Hrs / week : 06 SEE : 50 % SEE Hrs : 3 Hrs Max. Marks : 100  Prerequisite: Computer Organization  Course Outcome  On successful completion of the course the students will be able to 1. Differentiate between SIC and SIC/XE machine architecture and instruction set. 2. Analysis of basic concepts of an assembler’s functions and characteristics. 3. Compare the design and implementation of One-Pass and Multi-Pass Assembler. 4. Describe the design and implementation of Loaders and Linkers. 5. Explains the function of Macroprocessors. 6. Demonstrate the use of Lex and Yacc to write compiler. UNIT 1  Introduction: System software and machine architecture Machine Architecture: The Simplified Instructional Computer (SIC) – SIC Machine Architecture SIC/XE Machine Architecture SIC SIC/XE Programming Examples.  SLE: CISC machines RISC machines Comparison of CISC and RISC. 8 Hours  UNIT 2  Assemblers – 1: Basic Assembler Function – A Simple SIC Assembler Assembler Algorithm and Data Structures. Machine Dependent Assembler Features – Instruction Formats & Addressing Modes  SLE: Implementing Assembler Data structure like symbol table etc. 8 Hours  UNIT 3  Assemblers – 2: Machine Independent Assembler Features – Literals Symbol-Definition Statements Expression Program Blocks Control Sections and Programming Linking. Assembler Design Options – One-Pass Assembler Multi-Pass Assembler.  SLE: Case Study Multi-Pass Assembler. 9 Hours  UNIT – 4  Loaders and Linkers: Basic Loader Functions – Design of an Absolute Loader A Simple Bootstrap Loader. Machine-Dependent Loader Features – Relocation Program Linking Algorithm and Data Structures for a Linking Loader. Loader Design Options - Linkage editors Dynamic Linking.  SLE: Case study Bootstrap Loaders. 9 Hours    \\\"\",\"\\\"9\\\"\":\"\\\"UNIT – 5  Macro Processor: Basic Macro Processor Functions – Macro Definitions and Expansion Macro Processor Algorithm and Data Structures Machine- Independent Macro Processors Features.  SLE: Working of different macro processors. 8 Hours  UNIT – 6 Lex And Yacc : The Simplest Lex Program Recognizing Words With LEX Symbol Tables Grammars Parser-Lexer Communication The Parts of Speech Lexer A YACC Parser The Rules Section Running LEX and YACC LEX and Hand- Written Lexers Using LEX - Regular Expression Examples of Regular Expressions A Word Counting Program Parsing a Command Line. Using YACC - Grammars Recursive Rules A YACC Parser – The Definition Section The Rules Section Symbol Values and Actions The LEXER Compiling and Running a Simple Parser. SLE: Implementing a simple SIC assembler 9 Hours  Note: Implementation of the concepts taught in the theory classes will be done in laboratory sessions.  TEXT BOOKS  1. System Software Leland L Beck 3rd Edition Addison-Wesley Reprint 2010. 2. Lex and Yacc – John R Levine Mason and Doug Brown O’Reilly SPD 1998 REFERENCE BOOKS  1. System Programming and Operating Systems D M Dhamdhere TATA McGraw Hill 2nd Edition.                    \\\"\",\"\\\"10\\\"\":\"\\\"MANAGEMENT AND ENTREPRENEURSHIP (4:0:0)  Sub Code: CS0424 CIE: 50% Hrs/week: 04 SEE: 50% See Hrs: 3 Hrs Max Marks: 100  Course Outcome  On successful completion of the course the students will be able to  1. Provide the information about management as science art administration and as a key approach in doing a assigned work. 2. Explain planning and organizing with planning students learn its importance and hierarchy and with organizing students learn about departmentation committees centralization and decentralization. 3. Explain the importance of staffing directing and controlling meaning and steps in controlling. 4. Identifying who is an entrepreneur his functions and types and identifying based on geography. 5. Provide knowledge of small scale industry and institutional support. 6. Prepare project Selection; Project Report; Need and Significance of Report.  UNIT 1 Management: Introduction: Meaning - nature and characteristics of Management Scope and functional areas of management - Management as a science art or profession Management & Administration - Roles of Management Levels of Management. SLE: Development of Management Thought - early management approaches - Modern management approaches case studies on administration and management. 7 Hours  UNIT 2 Planning: Nature importance and purpose of planning process - Objectives - Types of plans (Meaning only) - Decision making - Importance of planning - steps in planning & planning premises - Hierarchy of plans. Organizing: Nature and purpose of organization - Principles of organization - Types of organization - Departmentation - Committees – CentralizationVsDecentralization of authority andresponsibility - Span of control - MBO and MBE (Meaning only).  SLE: Case studies on planning and organizing. 9 Hours  UNIT 3 Staffing: Nature and importance of Staffing - Process of Selection & Recruitment Directing & Controlling: Meaning and nature of directing - Leadership styles Motivation Theories Communication-Meaning and importance - Coordination meaning and importance and Techniques of Co - ordination. Meaning and steps in controlling - Essentials of a sound control system - Methods of establishing control.  SLE: Cases studies on staffing directing & controlling. 10 Hours  UNIT 4 Entrepreneur: Meaning of Entrepreneur; Evolution of the Concept Functions of an Entrepreneur Types of Entrepreneur Entrepreneur - an emerging Class. Concept of Entrepreneurship-Evolution of Entrepreneurship Development of Entrepreneurship; Stages in entrepreneurial process; Role of entrepreneurs in Economic Development; Entrepreneurship in India; Entrepreneurship – its Barriers.  \\\"\",\"\\\"11\\\"\":\"\\\"SLE: Case studies on entrepreneurs and overcoming barriers. 8 Hours  UNIT 5 Small Scale Industry: Definition; Characteristics; Need and rationale: Objectives; Scope; role of SSI in Economic Development. Advantages of SSI Steps to start an SSI - Government policy towards SSI; Different Policies of S.S.I.; Government Support for S.S.I. during 5 year plans Impact of Liberalization Privatization Globalization on S.5.1. Effect of WTO/GATT Supporting Agencies of Government for S.5.!. Meaning; Nature of Support; Objectives; Functions; Types of Help; Ancillary Industry and Tiny Industry (Definition only). Institutional Support: Different Schemes; TECKSOK; KIADB; KSSIDC; KSIMC; DIC Single Window Agency: SISI; NSIC; SIDBI;KSFC.  SLE: Case studies on setting up of small scale industries and institutional support. 10 Hours  UNIT 6 Preparation Of Project : Meaning of Project; Project Identification; Project Selection; Project Report; Need and Significance of Report; Contents; formulation; Guidelines by Planning Commission for Project report; Network Analysis; Errors of Project Report; Project Appraisal. Identification of Business Opportunities: Market Feasibility Study; Technical Feasibility Study; Financial Feasibility Study & Social Feasibility Study.  SLE: Case study on preparation of the project report and feasibility study . 8 Hours  TEXT BOOKS 1. Entrepreneurship development text and cases B Janakiram M Rizwana. 2. Management and Entrepreneurship NVR Naidu T Krishna Rao.  REFERENCE BOOKS 1. Management Fundamentals Concepts Application Skill Development Robert Lusier Thompson 2007. 2. Principles of Management P.C. Tripathi P.N. Reddy Tata McGraw Hill 2007. 3. Entrepreneurship Development S S Khanka S Chand & Co 2007. 4. Management Stephen Robbins 17th Edition Pearson Education / PHI 2003. 5. Web Sites for the Institutions listed in the Unit 5 on Institutional Support.  \\\"\",\"\\\"12\\\"\":\"\\\" MICROPROCESSOR INTERFACING LABORATORY (0:0:3)  Sub code : CS0106 Hrs / week : 03   Course Outcome  On successful completion of the course the students will be able to  1. Implement assembly language programs for 8086 microprocessor for the given applications.  2. Implement assembly language interfacing applications for Elevator Stepper Motor Keypad logic controller Display interface.   DATABASE LABORATORY (0:0:3)  Sub code: CS0107 Hrs/week : 03  Course Outcome:  At the end of this course the student will be able to  1. Explain his/her knowledge of database technology its importance its architectures and the central role Database technology plays in Information Systems.  2. Apply appropriate development methodologies of data analysis design and use appropriate modeling techniques for databases. 3. Demonstrate query facilities to formulate queries and manipulate the database e.g. Structured Query Language (SQL) 4. Appreciate the issues underlying database implementation in any database  5. Concentrate on a methodology for good database design and practical experience in designing and implementing standalone database system.         \\\"\",\"\\\"13\\\"\":\"\\\" BLOWN-UP SYLLABUS - VI SEMESTER   COMPUTER NETWORKS (4:0:0)  Sub code : CS0418 CIE : 50 % Hrs / week : 04 SEE : 50 % SEE Hrs : 03 Hours Max. Marks : 100  Prerequisite: Data Communications and Networking  Course Outcomes:  On successful completion of the course the students will be able to  1. Discuss the network layer services and learn the concepts of IP address Classes IPv4 Datagram.  2. Learn the auxiliary protocols in IPv4 and working of different Unicast Routing algorithms and protocols.  3. Discuss the concepts and working of IPv6 and various Multicast routing protocols.  4. Identify the services of the Transport layer and analyze the performances of UDP and TCP protocols.  5. Explain the congestion control in TCP and the working of SCTP.  6. Distinguish between various application layer protocols and analyze the need for information on DNS.   UNIT 1  Network Layer-I: Network layer services: Packetizing Routing and forwarding other services Packet switching: Datagram approach Virtual circuit approach.IPv4 addresses: Address space Classful addressing Classless addressing DHCP Network Address Resolution (NAT) Network Layer Protocols: Internet Protocol (IP): Datagram format fragmentation options.  SLE: Security of IPv4 datagrams. 9 hours UNIT 2  Network Layer Protocols-II ICMPv4: Messages debugging tools ICMP Checksum Mobile IP: Addressing Agents Three phases Inefficiency in Mobile IP Unicast Routing: Introduction General Idea Least cost routing Routing Algorithms: Distance Vector Routing Link State routing Unicast Routing Protocols: Internet Structure Routing Information Protocol(RIP) Path Vector Routing Algorithm Border Gateway Protocol(BGP): operation of External BGP(eBGP) Operation of Internal BGP(eBGP)  SLE: OSPF 8 hours  UNIT 3  Network Layer Protocols-III: Multicast Routing: Introduction Unicasting Multicasting broadcasting Intra-domain Multicast Protocols: DVMRP PIM. Inter-Domain Multicast Protocols; IGMP: Messages \\\"\",\"\\\"14\\\"\":\"\\\"Propagation of Membership Information and Encapsulation. IPv6 Addressing: Representation Address space Address space allocation Auto configuration and Renumbering The IPv6 Protocol: Packet Format Extension Header The ICMPv6 Protocol: Error Reporting Messages Information Messages Neighbor Discovery Messages and Group Membership Messages. SLE: Transition from IPV4 to IPV6 9 hours  UNIT 4  Transport Layer-I: Introduction to Transport layer: Process-to-process communication Addressing Encapsulation and Decapsulation Multiplexing and De-multiplexing Flow Control. Transport-Layer Protocols: Introduction: Services Port Numbers User Datagram Protocol: User Datagram UDP Services. Transmission Control Protocol: TCP services TCP Features Segment A TCP Connection Windows in TCP Flow Control Error control.  SLE: UDP Applications 9 hours UNIT 5  Transport Layer-II: TCP congestion control: Congestion Window Congestion detection Congestion policies Fast Recovery TCP timers options. SCTP: SCTP Services SCTP features Packet Format An SCTP Association Flow Control Error Control  SLE: Taho TCP 8 hours UNIT 6  Application Layer: Introduction: Transport-Layer Services: Providing Services Application layer Paradigms World Wide Web and HTTP. FTP: Two connections Control connection Data Connection Security for FTP. Electronic Mail: Architecture Web based Mail Email Security. Telnet: Local versus Remote Logging .Domain Name System: Name Space Flat Name Space DNS in the Internet Resolution Caching Resource Records DNS messages Registrars DDNS Security of DNS  SLE : Web documents 9 hours  TEXT BOOK:  1. Data Communications and Networking BehrouzA. Forouzan Tata McGraw-Hill 5th Edition 2013.  REFERENCEBOOKS:  1. Computer Networks Andrew S. Tanenbaum Pearson Education 4th Edition 2002. 2. Data and Computer Communication William Stallings Pearson Education 8th Edition 2007.  \\\"\",\"\\\"15\\\"\":\"\\\"OBJECT ORIENTED MODELING AND DESIGN (4:2:0)  Sub Code: CS0523 CIE: 50% Hrs/week: 6 SEE: 50% SEE Hrs: 3 Hrs Max Marks: 100  Prerequisite: Object Oriented Concepts  Course Outcomes  On successful completion of the course the students will be able to 1. Understand the importance of Classes Objects and their relationships.  2. Identify proper classification technique and apply suitable modeling notations..  3. Make use of suitable modeling notations to solve problems.  4. Explain the process mechanisms of software development life cycle.  5. Apply object-oriented techniques to solve real-world applications.  6. Classify and use patterns.  UNIT – 1  The Object Model: The Foundations of the Object Model Elements of the Object Model Applying the Object Model. Classes and Objects: The Nature of an Object Relationships among Objects The Nature of a Class Relationships among Classes The Interplay of Classes and Objects On Building Quality Classes and Objects.  SLE: The Inherent Complexity of Software the Five Attributes of a Complex System 8 Hours  UNIT – 2  Classifications: The importance of Proper Classification Identifying Classes and Objects. Method: Notation - The Unified Modeling Language Package Diagrams Component Diagrams Deployment Diagrams Use Case Diagrams Activity Diagrams.  SLE: Key Abstractions and Mechanisms. 9 Hours UNIT – 3  Method: Notation - Class Diagrams Sequence Diagrams Interaction Overview Diagrams Composite Structure Diagrams State Machine Diagrams Object Diagrams.  SLE: Timing Diagrams Communication Diagrams. 9 Hours UNIT – 4  Process: The Macro Process: The Software development Lifecycle The Micro Process: The Analysis and Design Process.  SLE: First Principles. 8 Hours  \\\"\",\"\\\"16\\\"\":\"\\\"UNIT – 5  Pragmatics: Management and Planning Staffing Release Management Reuse. Applications: Control System - Traffic Management: Inception Elaboration Construction Post Transition. Data Acquisition: Weather Monitoring Station: Inception Elaboration Construction Post Transition.  SLE: The Benefits and Risks of Object Oriented Development. 9 Hours UNIT – 6  Patterns: What is a pattern and what makes a pattern? Pattern categories: Relationships between patterns Pattern description. Communication Patterns: Forwarder-Receiver; Client-Dispatcher-Server; Publisher-Subscriber. Idioms: Introduction what can idioms provide? Where to find idioms?  SLE: Counted Pointer example. 9 Hours  TEXT BOOKS  1. Object-Oriented Analysis and Design with Applications Grady Booch Robert A. Maksimchuk Michael W. Engle Bobbi J.Young Jim Conallen Kelli A.Houston 3rd Edition Pearson 2007. (Chapters 1 2 3 4 5 6 7 9 11)  2. Pattern-Oriented Software Architecture A System of Patterns Frank Buschmann Regine Meunier Hans Rohnert Peter Sommerlad Michael Stal Volume 1 John Wiley and Sons 2006. (Chapters 1 3.5 3.6 4)  REFERENCE BOOKS  1. Object-Oriented Systems Analysis and Design Using UML Simon Bennett Steve McRobb and Ray Farmer: 2nd Edition Tata McGraw-Hill 2002.  2. Object-Oriented Modeling and Design with UML Michael Blaha James Rumbaugh 2nd Edition Pearson Education 2005.  3. Object-Oriented Analysis Design and Implementation Brahma Dathan Sarnath Ramnath Universities Press 2009.  4. UML 2 Toolkit Hans-Erik Eriksson Magnus Penker Brian Lyons David Fado Wiley Dreamtech India 2004.  5. Object-Oriented Systems Analysis and Design Using UML Simon Bennett Steve McRobb and Ray Farmer 2nd Edition Tata McGraw-Hill 2002.            \\\"\",\"\\\"17\\\"\":\"\\\"COMPILER DESIGN (4:0:0)  Sub code : CS0425 CIE : 50 % Hrs / week : 04 SEE : 50 % SEE Hrs : 03 Hours Max. Marks : 100  Course Outcome  On successful completion of the course the students will be able to 1. Explain Translation Process and Scanning Process of a Compiler. 2. Apply CFG to generate Syntax tree. 3. Describe top down parsing techniques for different languages. 4. Explain Semantic Analysis Phase of the compiler. 5. Compare memory organization of different run-time environments 6. Explain code generation techniques.  UNIT 1  INTRODUCTION AND SCANNERS: The Translation Process The Scanning Process The TINY Language Implementation of a TINY Scanner.  SLE: Finite Automata. 9 Hours  UNIT 2  CONTEXT-FREE GRAMMARS AND PARSING: The Parsing Process ParseTrees and Abstract Syntax Trees Extended Notations: EBNF and Syntax Diagrams Syntax of the TINY language.  SLE: context free grammar Ambiguity. 8 Hours  UNIT 3  TOP-DOWN PARSING: Top-Down Parsing by Recursive-Descent LL(1) Parsing First and Follow Sets A Recursive-Descent Parser for the TINY Language.  SLE: Implementation of Recursive-Descent Parser for the TINY Language. 9 Hours  UNIT 4  SEMANTIC ANALYSIS: Attributes and Attribute Grammars The Symbol Table Data Types and Type Checking A Semantic Analyzer for the TINY Language .  SLE: Algorithms for Attribute Computation 9 Hours      \\\"\",\"\\\"18\\\"\":\"\\\"UNIT 5  RUNTIME ENVIRONMENTS: Memory Organization during Program Execution Types of Runtime Environments: Fully Static Stack based Dynamic Memory (Overview of all three types) Stack-Based Runtime Environments without local procedures (in detail) Parameter Passing Mechanisms Runtime Environment for the TINY Language SLE: Dynamic Memory Runtime Environment 8 Hours  UNIT 6  CODE GENERATION: Intermediate Code and Data Structures for Code Generation: Three-Address code and P-code Code Generation of Data Structure References Code Generation of Control Statements and Logical Expressions TM: A simple Target Machine A Code generator for the TINY Language  SLE: Basic Code Generation Techniques. 9 Hours  Note: Refer to appendix B “Tiny compiler listing“ of the text book for implementation details   TEXT BOOK  1. Compiler construction Principles and Practice by Kenneth C Louden Thomson Publications.  REFERENCE BOOK  1. Compilers; Principles Techniques and Tools by Aho Monica S Lam J D Ullman Pearson Publications. 2. Compiler Construction by Niklaus Wirth. An Ebook in PDF available for free Download.                    \\\"\",\"\\\"19\\\"\":\"\\\" WEB TECHNOLOGIES AND APPLICATIONS (4:0:0)  Sub code : CS0450 CIE : 50 % Hrs / week : 04 SEE : 50 % SEE Hrs : 03 Hours Max. Marks : 100   Prerequisite: Object Oriented Programming Concepts  Course outcome  On successful completion of the course the students will be able to 1. Interpret the basics of java language 2. Implement advance features of java – inheritance multiple inheritance packages interface multithreading and exception handling 3. Illustrate the usage of I/O streams string handling and networking in java 4. Prepare dynamic web pages using XHTML CSS and XML 5. Create dynamic web pages using CGI and MYSQL 6. Demonstrate the creation of dynamic web pages using XHTML PHP MYSQL  UNIT 1  The Java Language – 1: The Genesis of Java: Java’s Lineage The creation of Java Why Java is important to the Internet? Java’s Magic Java features; An overview of Java Programming: Object oriented programming simple java program Lexical issues; Data types Variables and Arrays: Simple types Literals Variables Arrays Operators Control Statements Introduction to Java Classes: Classes Object Methods Constructors The this keyword Garbage collection The Finalize ( ) Method A Stack Class.  SLE: Type conversions and Casting 9 Hours  UNIT 2  The Java Language – 2: Methods and Classes; Inheritance; Inheritance Basic Using Super Creating Multilevel hierarchy When Constructors are Called Method Overriding Dynamic Method Dispatch Using Abstract Classes Using Final the Object Class; Java Packages and Interfaces; Exception Handling; Multithreading Programming.  SLE: Creation of User defined package 9 Hours  UNIT 3 Java I/O Streams & String Handling: I/O Basics Reading Consol Input Writing Consol Output The PrintWriter Class Reading and Writing files; String Handling: String Constructors String Length String Operations Character Extraction String Comparison Searching String Modifying a String valueOf(). Networking: Networking Basics.  SLE: StringBuffer Class. 9 Hours   \\\"\",\"\\\"20\\\"\":\"\\\"UNIT 4  XHTML XML and CSS: XHTML: Basic syntax; Standard XHTML document structure; Basic text markup Images; Hypertext Links; Lists; Tables; Forms; Frames; CSS: Introduction; Levels of style sheets; Style specification formats; Selector forms; Property value forms; Font properties; List properties; Color; Alignment of text; The Box model; Background images; The and tags; Conflict resolution. XML: Introduction; Syntax; Document structure; Document Type definitions; Namespaces; XML schemas; Displaying raw XML documents; Displaying XML documents with CSS.  SLE: Creation of Web Pages 8 Hours  UNIT 5 CGI and MYSQL: Introduction to Apache Web Server- Introduction Starting stopping and Restarting Apache Apache Log Files MYSQL: Introduction Tutorial DBI Table Joins CGI - Introduction A Simple CGI Program what can go wrong in the program? CGI.pm: Introduction CGI.pm HTML Shortcuts Information received by the CGI program Form Widget Methods Security consideration A note on die().  SLE: Loading and Dumping a Database Apache Configuration 9 Hours  UNIT 6  PHP and MYSQL: PHP Introduction Embedding PHP into HTML Configuration Quick examples Language Syntax Built-IN PHP Functions PHP and MySQL.  SLE: Connecting PHP to Mysql 8 Hours  TEXT BOOKS  1. The Complete Reference Java 2 Herbert Schildt 5th Edition Tata-McGraw-Hill 2008 2. Programming the World Wide Web Robert W. Sebesta 4th Edition Pearson Education 2008. 3. Open Source Web Development with Lamp James Lee and Brent Ware Pearson Education 2009 REFERENCE BOOKS  1. Internet and World Wide Web: How to Program -Harvey M. Deitel Paul J. Deitel 4thedition Pearson 2009. 2. The Web Programming Building Internet Applications- Chris Bates 3rd Edition Wiley India 2006. 3. The Java Handbook- 1st edition Patrick Naughton Tata McGraw - Hill Education (1996)    \\\"\",\"\\\"21\\\"\":\"\\\" WEB TECHNOLOGIES AND APPLICATIONS LABORATORY (0:0:3)  Sub code: CS0112 Hrs/week: 03  Course Outcome:  At the end of this course the student will be able to  1. Implement programs on Arrays Stack Class and Methods using java  2. Demonstrate usage of Interface Packages Multithreading and Exception handling in java  3. Explore working of I/O operations String class in java 4. Prepare web pages using HTML/XHTML and CSS. 5. Create dynamic web pages using XHTML CGI script and MYSQL 6. Construct dynamic web pages using XHTML/HTML PHP and MYSQL     COMPUTER NETWORKING LABORATORY (0:0:3)   Sub code: CS0109 Hrs/week: 03  Course Outcomes:  On Successful completion of the course the students will be able to:  1. Understand and illustrate cabling techniques and networking devices. 2. Configure and demonstrate working of Switch Router and Wireless Devices. 3. Understand and Illustrate ACLs and NAT. 4. Configure and demonstrate DHCP Server Static Routing and Dynamic Routing  \\\"\",\"\\\"22\\\"\":\"\\\"ELECTIVES  REAL TIME SYSTEMS (3:0:0) Sub code : CS0317 CIE : 50% Marks Hrs/week : 03 SEE : 50% Marks SEE Hrs : 03 Hours Max. Marks: 100  Course Outcomes On Successful completion of the course the students will be able to: 1. Comparing Hard and Soft Real Time Systems. 2. Identifying temporal parameters of real time work load. 3. Analyze the fundamental problems of Real Time Systems. 4. Analyze the performances of the real time scheduling. 5. Distinguish between Fixed priority versus Dynamic priority algorithms. 6. Analyze the performances of various real time protocols.  UNIT 1 Hard Versus Soft Real-Time Systems: Jobs and Processors Release Times Deadline and Timing Constraints Hard and Soft timing Constraints Hard Real-Time Systems Soft Real-Time Systems. SLE: Application of RTS. 7 Hours  UNIT 2 A Reference model of Real-Time systems: Processors and Resources Temporal Parameters of Real- Time Work load Periodic task model Precedence Constraints and Data dependency other types dependencies. SLE: Scheduling hierarchy Functional parameters of resources. 6 Hours  UNIT 3 Approaches to Real-Time Scheduling: Clock-Driven approach Weighted Round-Robin approach. Priority driven approach. Dynamic Versus Static Systems Effective Release times and deadlines optimality of the EDF and LST algorithms. SLE: off-Line versus on-line scheduling Non-Optimality of the EDF and LST algorithms. 7 Hours   \\\"\",\"\\\"23\\\"\":\"\\\" UNIT 4 Clock-driven Scheduling: Notations and assumptions static Timer-Driven Scheduler General Structure Cyclic Schedulers Cyclic executives Improving the average response time of a periodic jobs. SLE: Scheduling Sporadic Jobs. 6 Hours   UNIT 5 Priority-Driven Scheduling of Periodic Tasks: Static assumption Fixed Priority Versus Dynamic Priority algorithms Maximum Scheduling utilization Optimality of the RM and DM algorithms SLE: A schedulability test for fixed-Priority tasks with arbitrary response times. 6 Hours  UNIT 6 Resources and Resources Access Control: Assumptions on resources and their usage Effects of resources contention and resources access control Non preemptive critical section Basic Priority – Ceiling Protocol Stack-Based priority – Ceiling Protocol Use of priority-ceiling protocol in Dynamic- Priority Systems Preemption-Ceiling Protocol. SLE: Real time protocol Priority-Based Service Disciplines for switched Networks. 7 Hours  TEXT BOOK 1. Real Time Systems – Jane W.S. Liu Pearson Education Asia First Indian Reprint-2001.  REFERENCE BOOK 1. Real Time Systems Design and Analysis: An Engineer’s Hand book Second Edition Lapante.   \\\"\",\"\\\"24\\\"\":\"\\\" STORAGE AREA NETWORKS (3:0:0)  Sub code : CS0326 CIE : 50% Hrs/ Week : 03 SEE : 50% SEE Hrs : 3 Hours Max Marks : 100 Course Outcome:  On successful completion of the course the students will be able to 1. Explain basic concepts of storage networks such as I/O techniques disk subsystems 2. Compare various RAID levels in storage virtualization 3. Explain I/O technologies and Network Attached Storage. 4. Summarize Network File systems and file servers Storage virtualization and virtualization at various levels and use storage networks for data sharing data protection and digital archiving. 5. Classify types of Storage virtualization in the network SAN Architecture and Hardware devices. 6. Explain Software Components of SAN and Configuration options for SAN. UNIT 1 Introduction: Server Centric IT Architecture and its Limitations; Storage – Centric IT Architecture and its advantages. Intelligent Disk Subsystems -1: Architecture of Intelligent Disk Subsystems; Hard disks and Internal I/O Channels. SLE: Case study: Replacing a server with Storage Networks 6 Hours UNIT 2 Intelligent Disk Subsystems -2 I/O Technologies -1: Storage virtualization using RAID and different RAID levels; Caching: Acceleration of Hard Disk Access. SLE: Availability of disk subsystems 6 Hours  UNIT 3 I/O Technologies- 2: SCSI. Network Attached Storage: Fibre Channel Protocol Stack;  SLE: The Physical I/O path from the CPU to the Storage System 6 Hours  \\\"\",\"\\\"25\\\"\":\"\\\"UNIT 4  File System And NAS: Local File Systems; Network file Systems and file servers. Storage Virtualization-1: Definition of Storage virtualization; Implementation Considerations; Storage virtualization on Block or file level.  SLE: Case Studies: Direct Access File System. 7 Hours  UNIT 5 Storage Virtualization-2: Symmetric and Asymmetric storage virtualization in the Network. SAN Architecture and Hardware devices: Overview creating a Network for storage; SAN Hardware devices The fibre channel switch Host Bus adaptors.  SLE: Hardware devices: - Putting the storage in SAN 7 Hours  UNIT6 Software Components of SAN: The switch’s Operating system Device Drivers The Supporting the switch’s components.  SLE: Configuration options for SANs -.The Evolving Network Connections 7 Hours  TEXT BOOKS:  1. Storage Networks Explained UlfTroppens Rainer Erkens and Wolfgang Muller John Wiley & Sons 2003. 2. Storage Networks:The Complete Reference Robert Spalding Tata McGraw Hill 2003.  REFERENCE BOOKS:  1. Information storage and management EMC Education services Wiley India 2009 G Somasundaram Alok Srivatsava 2. Storage Area Network Essentials: A Complete Guide to understanding and Implementing SANs Richard Barker and Paul Massiglia John Wiley India 2002. 3. Storage Networking Fundamentals Marc Farley Cisco Press 2005.   \\\"\",\"\\\"26\\\"\":\"\\\"LINUX INTERNALS (3:0:0) Sub code : CS0318 CIE : 50 % Hrs / week : 03 SEE : 50 % SEE Hrs : 3 Hours Max. Marks : 100  Course Outcome On successful completion of the course the students will be able to 1. Explain Linux Operating System basics Kernel. booting process 2. Analyze memory management in Linux 3. Describe Inter process Communication and compare File Systems in Linux 4. Experiment with Device Drivers in Linux. 5. Illustrate Network Implementation and Debugging. 6. Make Use Kernel related commands.  UNIT 1 Linux-The Operating System: Main Characteristics Linux Distributions: Compiling the kernel Where is everything? Compiling Additional Configuration facilities Introduction to kernel: important data structures main algorithms implementation of system Calls The Booting process: Carrying out the booting processes SLE: LILO-the Linux Loader GRUB Etc. 7 Hours  UNIT 2 Memory Management: The Architecture-independent Memory model The Virtual address space of a process Block device caching Paging under Linux SLE: Paging under linux 6 Hours  UNIT 3 Interprocess communication: Synchronization in the kernel Communication via files Pipes System V IPC File System: Basic principles The representation of file system in kernel The ext2 SLE: Debugging using ptrace proc file system ext3 6 Hours  UNIT 4 Device Drivers Under Linux: Character and Block devices Hardware Polling interrupts and waiting queues. SLE: Implementing a driver Dynamic and static drivers 7 Hours  \\\"\",\"\\\"27\\\"\":\"\\\"UNIT 5  Network Implementation: Introduction and overview Important structures Network Devices under Linux Modules and Debugging: what are modules? Implementation in the kernel the meaning of object sections for modules and kernels parameter transfer and examples What can be implemented as a module? the kernel daemon Simple data swapping between modules . SLE: Configuring the network interface An example module Debugging. 7 Hours  UNIT 6  Kernel-Related Commands: Overview of the system's memory ps-output of processes statistics top- the CPU charts init-primus inter pares shutdown the system strace monitoring a process trace-route Ariadne's paths in the internet . SLE: Configuring a serial interface configuring the parallel interface Building a directory tree 6 Hours  TEXT BOOKS: 1. Linux Kernel Programming M. Beck et.al. III edition Pearson Education 2002 2. Linux Kernel Development Robert Love Pearson Education 2004 3. Understanding the Linux Kernel Daniel Bovet Marco Cesati. III Edition O'rielly Publications 2005  \\\"\",\"\\\"28\\\"\":\"\\\" DESIGN OF THE UNIX OPERATING SYSTEM (3:0:0)  Sub code : CS0320 CIE : 50 %Marks Hrs / week : 03 SEE : 50 %Marks SEE Hrs : 03 Hours Max. Marks : 100  Course outcome: On successful completion of the course the students will be able to 1. Understand the Unix system concepts 2. Understand the design of Unix Kernel and buffer cache 3. Demonstrate a clear view of the File System 4. Understand the structure of processes in UNIX OS 5. Understand the concept of Process Control and Management 6. explain the concept of memory management and I/O subsystems  UNIT 1 Overview of the UNIX System  System structure user perspective Operating System services assumption about H/W. Architecture of UNIX operating system introduction to system concepts kernel data structure  SLE: System Administration 6 Hours  UNIT 2 The Buffer Cache Buffer headers structure of the buffer pool scenarios for retrieval of a buffer reading and writing disk blocks SLE: Advantages and Disadvantages of Cache 6 Hours  UNIT 3 Internal Representation of Files  Inodes structure of the regular file directories conversion of a pathname to inode super block inode assignment to a new file allocation of disk blocks other file types System Calls for the File System and change Root Pipes Mounting and Unmounting File Systems SLE: Super Block 8 Hours     \\\"\",\"\\\"29\\\"\":\"\\\"UNIT 4 The Structure of process  Process stages and transitions layout of system memory the context of a process saving Context of a process manipulation of the process address space SLE: Sleep. 6 Hours   UNIT 5 Process Control & Scheduling Process creation signals process termination awaiting process termination invoking other programs the user id of a process the shell system Boot and the Init process. Process Scheduling system call for time clock SLE: Real Time processing 7 Hours  UNIT 6 Memory Management and I/O Subsystem Swapping Demand paging Driver Interfaces Disk Drivers Streams SLE: A Hybrid system with swapping and demand paging 6 Hours TEXT BOOK: The Design of The UNIX Operating System: Maurice J. Bach Prentice-Hall.  REFERENCE BOOKS: 1. UNIX Internals: Steve D. Pate Addison-Wesley. 2. UNIX Operating System Source Code Level Six: J. Lions Department of Computer Science The University of New South Wales. 3. A commentary on the sixth edition UNIX Operating System: J. Lions Department of Computer Science The University of New South Wales. 4. Operating Systems – A Practical Approach: Robert Switzer Prentice-Hall (1993). 5. A Practical Approach to Operating Systems: Malcolm G. Lane James D. Mooney Boyd and Fraser Pub. co. (1998). 6. Operating System Design: The XINU Approach: Douglas Comer Prentice Hall 1stedition (1983). \\\"\",\"\\\"30\\\"\":\"\\\"` PROTOCOL ENGINEERING (3:0:0)  Sub code : CS0327 CIE : 50 %Marks Hrs / week : 03 SEE : 50 %Marks SEE Hrs : 03 Hours Max. Marks : 100  Course Outcome  On successful completion of the course the students will be able to  1. Familiarize with the concept of protocols and their representation and discuss the phases of protocol engineering 2. Identify the components of protocol to be specified and to create formal specification of protocol using finite state machine 3. Design and develop SDL based specification of protocols 4. Apply different types of protocol verification and validation techniques 5. Compare different types of test sequence generation techniques and explain performance parameters 6. Discuss methods for interactive building of correct protocol specification and its implementation issues  UNIT 1 Introduction: Communication model Communication Software Communication Subsystems Communication Protocol Definition/Representation Formal and Informal Protocol Development Methods Protocol Engineering Phases Network Reference Model: Layered Architecture Network Services and Interfaces Protocol Functions: Encapsulation Segmentation Reassembly Multiplexing Addressing OSI Model Layer Functions TCP/IP Protocol Suite Application Protocols. SLE: Informal representation of TCP protocol 6 Hours  UNIT 2 Protocol Specification: Components of specification Service specification Communication Service Specification Protocol entity specification: Sender Receiver and Channel specification Interface specifications Interactions Multimedia specifications Alternating Bit Protocol Specification.. SLE: RSVP specification 6 Hours   \\\"\",\"\\\"31\\\"\":\"\\\"` UNIT 3 Protocol Specification Language (SDL): Salient Features. Communication System Description using SDL Structure of SDL Data types and communication paths. Examples of SDL based Protocol Specifications: Question and answer protocol X-on-X-off protocol Alternating bit protocol Sliding window protocol specification TCP protocol specification SDL based platform for network OSPF Multi Protocol Label Switching. SLE:BGP 7 Hours  UNIT 4 Protocol Verification / Validation: Protocol Verification using FSM ABP Verification protocol validation Protocol Design Errors: Deadlocks Unspecified Reception Non-executable Interactions State Ambiguities Protocol Validation Approaches: Perturbation Technique Reachability Analysis Fair Reachability Graphs SDL Based Protocol Verification: ABP Verification SDL Based Protocol Validation: ABP Validation. SLE: Process Algebra based Validation Reachability Tree of a protocol 6 Hours  UNIT 5 Protocol Conformance and Performance Testing: Conformance Testing Methodology and Framework Local and Distributed Conformance Test Architectures Test Sequence Generation Methods: T U D and W methods Distributed Architecture by Local Methods Synchronizable Test Sequence Conformance Testing of RIP Testing Multimedia Systems quality of service test architecture (QOS). SLE: Conformance testing with Tree and Tabular Combined Notation (TTCN ) 7 Hours  UNIT 6 Protocol performance testing: Performance Test methods SDL Based Performance Testing of TCP Interoperability testing Scalability testing protocol. Protocol Synthesis and Implementation: Synthesis methods Interactive Synthesis Algorithm Automatic Synthesis Algorithm Automatic Synthesis of SDL from MSC Protocol Re-synthesis Requirements of Protocol Implementation Objects Based Approach to Protocol Implementation Protocol Compilers. SLE: SDL based performance testing of OSPF 7 Hours  TEXT BOOK: 1. PallapaVenkataram and Sunilkumar S. Manvi: Communication Protocol Engineering PHI 2004. REFERENCE BOOK: 1. Mohammed G. Gouda: Elements of Protocol Design Wiley Student Edition 2004. \\\"\",\"\\\"32\\\"\":\"\\\"` COMPUTER GRAPHICS AND VISUALIZATION (3:0:0)  Course outcome On successful completion of the course the students will be able to 1. Explain the basic components in computer graphic system. 2. Identify and Illustrate the OpenGL APIs with examples. 3. Identify and illustrate Interactive Programs and Animating Interactive Programs. Design of Interactive Programs. 4. Explain and identify basics of Geometric Objects and Transformations 5. Explain identify and illustrate Geometric Objects and Transformations in Homogeneous Coordinates using OpenGL. 6. Analyze and compare Classical and computer viewing.  UNIT 1 Introduction: Applications of computer graphics; A graphics system; Images: Physical and synthetic; Imaging Systems; The synthetic camera model; The programmer’s interface; Graphics architectures; Graphics Programming: The Sierpinski gasket. SLE: Programming Two Dimensional Applications. 6 Hours  UNIT 2 The OpenGL: The OpenGL API; Primitives and attributes; Color; Viewing; Control functions; The Gasket program; Polygons and recursion; Input: Interaction; Input devices; Clients and Servers; Display Lists Display Lists and Modeling; SLE: The three-dimensional gasket; 7 Hours  UNIT 3 Interaction: Programming Event Driven Input; Menus; Picking; Building Interactive Models; Animating Interactive Programs; Design of Interactive Programs. SLE: Logic Operations 6 Hours  UNIT 4 Geometric Objects and Transformations-I: Scalars Points and Vectors; Three-dimensional Primitives; Coordinate Systems and Frames; Modeling a Colored Cube; Affine Transformations; Rotation. SLE: Translation and Scaling; 6 Hours Sub code : CS0307 CIE : 50 %Marks Hrs / week : 03 SEE : 50 %Marks SEE Hrs : 03 Hours Max. Marks : 100 \\\"\",\"\\\"33\\\"\":\"\\\"` UNIT 5 Geometric Objects and Transformations-II: Geometric Objects and Transformations; Transformation in Homogeneous Coordinates; Concatenation of Transformations; OpenGL Transformation Matrices. SLE: Interfaces to three-dimensional applications; 7 Hours  UNIT 6 Viewing: Classical and computer viewing; Viewing with a Computer; Positioning of the camera; Simple projections; Projections in OpenGL; Hidden-surface removal; Interactive Mesh Displays; Parallel- projection matrices; Perspective-projection matrices. SLE: Projections and Shadows. 7 Hours  TEXT BOOKS: 1. Edward Angel: Interactive Computer Graphics A Top-Down Approach with OpenGL 5th Edition Pearson Education 2008. (Chapters 1 to 5) REFERENCE BOOKS: 1. Donald Hearn and Pauline Baker: Computer Graphics- OpenGL Version 3rd Edition Pearson Education 2004. 2. F.S. Hill Jr.: Computer Graphics Using OpenGL 2nd Edition Pearson education 2001. 3. James D Foley Andries Van Dam Steven K Feiner John F Hughes Computer Graphics Addison-Wesley 1997. \\\"\",\"\\\"34\\\"\":\"\\\"` MULTIMEDIA COMPUTING (3:0:0) Sub code : CS0308 CIE : 50 %Marks Hrs / week : 03 SEE : 50 %Marks SEE Hrs : 03 Hours Max. Marks: 100  Course outcome On successful completion of the course the students will be able to 1. Discuss types of multimedia networks and multimedia applications 2. Compare the different types of document formats 3. Design the different types of text compression techniques 4. Apply different types of compression techniques on audio and images 5. Analyze the different types of video compression techniques 6. Compare the different standards for the multimedia communications  UNIT 1 Multimedia communications Introduction; Multimedia information representation; Multimedia networks: Telephone networks Data networks Broadcast television networks Integrated services digital networks Broadband multiservice networks; Multimedia applications : Interpersonal communications Interactive applications over the Internet Entertainment applications; Application and networking terminology : Media types Communication modes Network types Multipoint conferencing . SLE: Applications of Multimedia Communications. Network QoS Application QoS 7 Hours  UNIT 2 Multimedia information representation Introduction; Digitization principles: Analog signals Encoder design Decoder design; Text: Unformatted text Formatted text Hypertext; Images: Graphics Digitized documents Digitized pictures; Audio: PCM speech CD-quality audio synthesized audio; Video: Broadcast television Digital video PC video Video content. SLE: Audio and Video Representation in Multimedia 7 Hours  UNIT 3 Compression Techniques(Text Image Audio and Video): Introduction; Compression principles: Source encoders and destination decoders Lossless and lossy compression Entropy encoding Source encoding; Text compression: static Huffman coding Dynamic Huffman coding Arithmetic coding SLE: Lempel-Ziv coding Lempel-Ziv-Welsh coding 6 Hours \\\"\",\"\\\"35\\\"\":\"\\\"` UNIT4 Image compression: Graphics interchange format Tagged image file format Digitized documents Digitized pictures JPEG. Audio compression: Introduction; Differential pulse code modulation Adaptive differential PCM Adaptive predictive coding Linear predictive coding Code-excited LPC perceptual coding MPEG audio coders. SLE: Audio Compression Dolby audio coders 7 Hours  UNIT 5 Video compression: Video compression principles H.261 H.263 MPEG MPEG-1 MPEG-2 MPEG-4. SLE: MPEG-4 H.261 H.263 6 Hours  UNIT 6 Standards for multimedia communications Introduction; Reference models: TCP/IP reference model protocol basics; Standards relating to interpersonal communications: Circuit-mode networks packet-switched networks Electronic mail; Standards relating to interactive applications over the Internet: Information browsing Electronic commerce Intermediate systems java and JavaScript; Standards for entertainment applications: Movie/video-on-demand Interactive television. SLE: Standards for Multimedia Communications Video on Demand 6 Hours   TEXT BOOK 1. Multimedia Communications – Applications Networks Protocols and Standards – Fred Halsall Pearson Education 2009.  REFERENCE BOOKS: 1. Multimedia computing communications and Applications - Ralf Steinmetz Klara Narstedt 2nd Edition Pearson Education 2001. 2. Multimedia System Design- Prabhat K. Andleigh Kiran Thakrar PHI 2003. 3. Multimedia Communication Systems: Techniques Standards and Networks–K.R. Rao Zoran S. Bojkovic and Dragorad A. Milovanovic Pearson Education 2002. 4. Multimedia Information Networking- Nalin K. Sharad PHI 2002  \\\"\",\"\\\"36\\\"\":\"\\\"` INTRODUCTION TO C# PROGRAMMING AND .NET CONCEPTS (3:0:0)  Sub code : CS0312 CIE : 50%Marks Hrs/week : 03 SEE : 50%Marks SEE Hrs :03 Hours Max. Marks :100  Course Outcome  On successful completion of the course the students will be able to 1. Explain the basics of .Net platform and the role of base class libraries role of common intermediate language and namespaces. 2. Discuss the fundamentals of c# and to build the basic c# program using different constructs. 3. Review the basic pillars of object oriented programming concepts. 4. Apply the exception handling technique to handle different types of errors. 5. Provide the knowledge about basics of object lifetime and to define the use of interfaces and collections. 6. Explain the callback interfaces delegates events and its implementation.  UNIT 1 THE PHILOSOPHY OF .NET: Understanding the Previous State of Affairs The .NETSolution The Building Block of the .NET Platform (CLR CTS and CLS) The Role of the .NET Base Class Libraries What C# Brings to the Table An Overview of .NET Binaries ( aka Assemblies ) the Role of the Common Intermediate Language The Role of .NET Type Metadata The Role of the Assembly Manifast Compiling CIL to Platform –Specific Instructions Understanding the Common Type System Intrinsic CTS Data Types Understanding the Common Languages Specification Understanding the Common Language Run-time A tour of the .NET Namespaces. SLE: Increasing Your Namespace Nomenclature 7 Hours  UNIT 2 C# LANGUAGE FUNDAMENTALS: The Anatomy of a Basic C# Class Creating objects:Constructor Basics The Composition of a C# Application Default Assignment and Variable Scope The C# Member Initialization Syntax Basic Input and Output with the Console Class Understanding Value Types and Reference Types The Master Node System.Object The System Data Types (and C# Aliases) Converting Between Value Types and Reference Types Boxing and Unboxing Defining Program Constants C# Iteration Constructs C# Controls Flow Constructs The Complete Set of C# Operators Defining Custom Class Methods Understating Static Methods Methods Parameter Modifies Array Manipulation in C # String Manipulation in C# C# Enumerations Defining Structures in C# Defining Custom Namespaces. SLE: Programming using basic constructs of c# 7 Hours  UNIT 3 OBJECT- ORIENTED PROGRAMMING WITH C#: Forms Defining of the C# Class Definition the \\\"Default Public Interface\\\" of a Type Recapping the Pillars of OOP The First Pillars: C#'s Encapsulation Services Pseudo- Encapsulation: Creating Read-Only Fields The Second Pillar: C#'s Inheritance Supports keeping Family Secrets: The \\\"Protected\\\" Keyword Nested Type Definitions The Third Pillar: C #'s Polymorphic Support Casting Between. SLE: Object oriented programming using VS.NET 6 Hours  \\\"\",\"\\\"37\\\"\":\"\\\"` UNIT 4  EXCEPTIONS :Ode to Errors Bugs and Exceptions The Role of .NET Exception Handing the System. Exception Base Class Throwing a Generic Exception Catching Exception CLR System – Level Exception (System.System Exception) Custom Application-Level Exception (System. System Exception) Handling Multiple Exception The Family Block the Last Chance Exception Dynamically Identifying Application – and System Level Exception Debugging System. SLE: Exception Using VS.NET 6 Hours  UNIT 5  OBJECT LIFETIME: Understanding Object Lifetime the CIT of \\\"new' The Basics ofGarbage Collection Finalization a Type The Finalization Process Building an Ad Hoc Destruction Method Garbage Collection Optimizations The System. GC Type. INTERFACES AND COLLECTIONS: Defining Interfaces Using C# Invoking InterfaceMembers at the object Level Exercising the Shapes Hierarchy Understanding Explicit Interface Implementation Interfaces As Polymorphic Agents Building Interface Hierarchies SLE: Building custom Interfaces and collections using VS.NET 7 Hours  UNIT 6  CALLBACK INTERFACES DELEGATES AND EVENTS ADVANCED TECHNIQUES: Understanding Callback Interfaces Understanding the .NET Delegate Type Members of System. Multicast Delegate The Simplest Possible Delegate Example Building More a Elaborate Delegate Example Understanding Asynchronous Delegates Understanding (andUsing)Events. .SLE :Building callback interfaces delegates and events using VS.NET 6 Hours   TEXT BOOK  1. C# and the .NET platform - Andrew Troelsen Special Edition Dream Tech Press India 2003.  REFERENCE BOOK:  1. Inside C# - Tom Archer WP Publishers 2001.                      \\\"\",\"\\\"38\\\"\":\"\\\"`  EMBEDDED SYSTEMS (3:0:0)      Course Outcome On successful completion of the course the students will be able to  1. Describe the fundamentals of Embedded Systems. 2. Develop necessary skills to understand and design an embedded system application. 3. Identify the challenges of Concurrent Process and its solutions. 4. Compare the advantages of the software Architectures and design an embedded system application using an RTOS. 5. Describe the inter task communication primitives like semaphores and message queues. and design the hardware along with the choice of the RTOS for the application at hand. 6. Describe the Embedded Software Development Tools and Model the requirements of an application as a set of tasks.  UNIT 1 Custom single-purpose processor design; RT-level custom single-purpose processor design; Optimizing custom single-purpose processors: optimizing the FSMD Optimizing the data-path optimizing the FSM. SLE : Optimizing the Original Program. 7 Hours  UNIT 2 Timers counters and watchdog timers. State machine models: Introduction; finite-state machines (FSM); Finite-state machines with data path model (FSMD); Using state machines: Describing a system as a state machine Comparing state machine and sequential program models Capturing a state machine model in a sequential programming language; Hierarchical/Concurrent state machine model (HCFSM) and the State charts language; Program state machine model (PSM); SLE : An introductory example A basic state machine model. 7 Hours  Sub code : CS0331 CIE : 50 %Marks Hrs / week : 03 SEE : 50 %Marks SEE Hrs : 03 Hours Max. Marks : 100 \\\"\",\"\\\"39\\\"\":\"\\\"` UNIT 3 Concurrent process models: Concurrent processes: Process create and terminate Process suspend and resume Process join; Communication among processes: Shared memory Message passing; Synchronization among processes: Condition variables Monitors. Interrupts: The Shared Data Problem. SLE : Interrupt Basics. 7 Hours  UNIT 4 Survey of Software Architecture: Round Robin with Interrupts Function Queue Scheduling Architecture; Real Time Operating System Architecture Selecting architecture. Introduction to RTOS: Tasks and Task States Tasks and Data Semaphores and shared data. SLE: Round Robin. 7 Hours  UNIT 5 Basic Design Using an RTOS: Overview Principles An Example Encapsulating semaphores and Queues Hard Real-Time Scheduling Considerations. SLE:Saving Power. 6 Hours  UNIT 6 Embedded Software Development Tools: Host and Target Machines Linker/Locator for Embedded Software getting embedded software into the Target System SLE: Environment in which the program operates. 5 Hours  TEXT BOOKS 1. Embedded System Design: A Unified Hardware/ Software Introduction - Frank Vahid Tony Givargis John Wiley & Sons Inc.2002 2. An Embedded Software Primer - David E. Simon: Pearson Education 1999.  REFERENCE BOOKS 1. Embedded C: Michael J. Pont Pearson Education (2002). 2. Real-Time Systems and Programming Languages: Alan Burns and Andy Wellings 3. Embedded Systems Building Blocks Second Edition - Complete and Ready-to-Use Modules in C: Jean J. Labrosse CMP; 2nd edition (1999)  \\\"\",\"\\\"40\\\"\":\"\\\"` GAME THEORY (3:0:0)  Sub Code : CS0310 CIE : 50% Marks Hrs/Week : 03 SEE : 50% Marks SEE Hrs : 03 Max Marks : 100  Course Outcome On successful completion of the course the students will be able to 1. Familiarize with basics of game theory examine and evaluate different situations using game theoretic approach. 2. Compare applications of deterministic outcome and probabilistic outcome (mixed strategy) 3. Construct sub-games under extensive game with perfect information and illustrates to find sub game perfect equilibrium. 4. Compute Nash equilibrium for situations which can be modeled as Bayesian games. 5. Test the theory of Nash equilibrium in strictly competitive games and analyze rationalizability of a game. 6. Acquire knowledge on monomorphic and polymorphic evolutionary games and analyze repeated games.  UNIT 1 INTRODUCTION; STRATEGIC GAMES: What is game theory? The theory of rational choice interacting decision makers. Strategic games; Example: The prisoner’s dilemma; Nash equilibrium; Examples of Nash equilibrium; Best-response functions; Dominated actions; Equilibrium in a single population: symmetric games and symmetric equilibria. SLE: Find Nash equilibrium for BOS and Stag -Hunt game 7 Hours  UNIT 2 MIXED STRATEGY EQUILIBRIUM: Introduction; Strategic games in which players may randomize; Mixed strategy Nash equilibrium; Dominated actions; Pure equilibria when randomization is allowed illustration; Equilibrium in a single population illustration; The formation of players’ beliefs; Extensions; Representing preferences by expected payoffs. SLE: Find Mixed strategy Nash equilibrium for prisoner’s dilemma 7 Hours  \\\"\",\"\\\"41\\\"\":\"\\\"` UNIT 3 EXTENSIVE GAMES: Extensive games with perfect information; Strategies and outcomes; Nash equilibrium; Subgame perfect equilibrium; Finding subgame perfect equilibria of finite horizon games. Extensions: Allowing for simultaneous moves illustration: entry into a monopolized industry Discussion: subgame perfect equilibrium and backward induction. SLE: Problems on finding subgame perfect equilibrium and backward induction 7 Hours  UNIT 4 BAYESIAN GAMES: Motivational examples; General definitions; Two examples concerning information; Illustration: auctions; Extensive games with imperfect information; Strategies; Nash equilibrium; Beliefs and sequential equilibrium; Signaling games; Illustration: strategic information transmission. SLE: Auctions with an arbitrary distribution of valuations 6 Hours  UNIT 5 STRICTLY COMPETITIVE GAMES RATIONALIZABILITY: Strictly competitive games and maximization; Maximization and Nash equilibrium; Strictly competitive games; Maximization and Nash equilibrium in strictly competitive games. Rationalizability; Iterated elimination of strictly dominated actions; Iterated elimination of weakly dominated actions; Dominance solvability. SLE: Problems on Iterated elimination of weakly dominated actions 6 Hours  UNIT 6 EVOLUTIONARY EQUILIBRIUM ITERATED GAMES: Monomorphic pure strategy equilibrium; Mixed strategies and polymorphic equilibrium; Asymmetric contests; Variations on themes: Sibling behavior.. Repeated games: The main idea; Preferences; Repeated games; Finitely and infinitely repeated Prisoner’s dilemma; Repeated games: Nash equalibria of general infinitely repeated games finitely repeated games. SLE: Nash equilibrium of an infinitely repeated Prisoner’s dilemma. 6 Hours  TEXT BOOK 1. An Introduction to Game Theory – Martin Osborne Oxford University Press Indian Edition 2004. REFERENCE BOOKS 1. Game Theory: Analysis of Conflict – Roger B. Myerson Harvard UniversityPress 1997. 2. Microeconomic Theory – Andreu Mas-Colell Michael D. Whinston and JerryR. Green Oxford University Press New York 1995. 3. Game Theory and Strategy – Philip D. Straffin Jr. TheMathematicalAssociation of America January 1993. \\\"\",\"\\\"42\\\"\":\"\\\"` ADHOC NETWORKS (3:0:0)  Sub code : CS0328 CIE : 50 % Hrs / week : 03 SEE : 50 % SEE Hrs : 03 Hours Max. Marks : 100 Course Outcome On successful completion of the course the students will be able to  1. Identify the unique issues in ad-hoc wireless networks. Knowledge of the current technology trends for the implementation and deployment of Ad-hoc wireless networks. 2. Identify the challenges in designing MAC protocols for Ad-hoc networks and discuss the working of MAC protocols 3. Explain the challenges in designing Routing Protocols for Ad-hoc networks and discuss the working of Table-Driven Routing protocols 4. Explain the challenges in designing Routing Protocols for Ad-hoc networks and discuss the working of On-Demand Routing protocols 5. Describe the challenges in designing Transport Protocols for Ad-hoc networks and discuss the working of Transport protocols 6. Describe the challenges in designing Security Protocols for Ad-hoc networks and discuss the working of Security protocols  UNIT 1 INTRODUCTION: Cellular and Ad Hoc Wireless networks Applications of Ad Hoc wireless networks; Issues in Ad hoc wireless networks: Medium Access Scheme Routing Multicasting Transport Layer Protocols Pricing Scheme Quality of service positioning Self-organization Security Addressing and Service Discovery Energy Management Scalability Deployment Considerations; SLE: Ad hoc wireless Internet. 7 Hours   UNIT 2 MAC PROTOCOLS: MAC Protocols for Ad hoc wireless Networks: Introduction Issues in designing a MAC protocol for Ad hoc wireless Networks Design goals of a MAC protocol for Ad-hoc wireless Networks Classification of MAC Protocols Contention based protocols with reservation mechanisms: D- PRMA CATA SRMA/PA FPRP HRMA SLE: MACA/PR. 7 Hours \\\"\",\"\\\"43\\\"\":\"\\\"` UNIT 3 ROUTING PROTOCOLS: Routing protocols for Ad-hoc Wireless Networks: Introduction Issues in Designing a Routing Protocol for Ad-hoc Wireless Networks Classification of Routing Protocols. TABLE DRIVEN ROUTING PROTOCOLS: DSDV WRP CGSR SLE: STAR protocol 6 Hours  UNIT - 4 ROUTING PROTOCOLS- II: On-Demand Routing Protocols: Dynamic source Routing Protocol (DSR) AODV TORA LAR ABR and FORP. SLE: SSA protocol 6 Hours  UNIT - 5 TRANSPORT LAYER: Transport Layer Protocols for Ad-hoc wireless Networks: Introduction Issues in Designing a Transport Layer Protocol for Ad-hoc wireless Networks Design Goals of a Transport Layer Protocol for Ad hoc wireless Networks Classification of Transport Layer Solutions TCP over Ad-hoc wireless Networks: Feedback-Based TCP TCP with Explicit Failure Notification TCP-BUS Split TCP. SLE: ATP 7 Hours  UNIT 6 SECURITY: Security in wireless Ad hoc wireless Networks Network security requirements Issues & Challenges in Security Provisioning Network security Attacks Key Management: Symmetric and Asymmetric key Algorithms key Management Approaches key management in Ad-hoc Wireless Networks: Secure routing in Ad hoc wireless Networks: Requirements SAR protocol SLE: ARAN 6 Hours  TEXT BOOK 1. Ad hoc Wireless Networks – C. Siva Ram Murthy & B. S. Manoj 2nd Edition Pearson Education 2005.  REFERENCE BOOKS 1. Ad hoc Wireless Networks – Ozan K. Tonguz and Gianguigi Ferrari John Wiley 2006. 2. Ad hoc Wireless Networking – Xiuzhen Cheng Xiao Hung Ding-Zhu Du Kluwer Academic Publishers 2004. 3. Adhoc Mobile Wireless Networks - C.K. Toh Protocols and Systems Prentice-Hall 2002.  \\\"\",\"\\\"44\\\"\":\"\\\"` WIRELESS COMMUNICATION NETWORKS (3:0:0)  Sub code : CS0305 CIE: 50% Hrs/ week :03 SEE :50% SEE Hrs : 3 Hours Max Marks : 100  Course Outcomes:  On Successful completion of the course the students will be able to:  1. Describe the evolution of wireless communication and early growth of cellular radio around the world.  2. Outline an overview of the major wireless communication systems of 21’st century.  3. Illustrates the fundamental cellular radio concepts such as frequency reuse handoff and interference issues.  4. Analyze different ways to model and predict the large scale effects of radio propagation in different operating environments.  5. Explains the most common analog and digital modulation techniques used in wireless communication along with its tradeoffs.  6. Evaluate the Multiple Access Techniques for Wireless Communications so as to accommodate large number of users and impact the system capacity and infrastructure of cellular systems. UNIT 1 Introduction to Wireless Communication Systems & Networking: Evolution of Mobile Radio Communication examples of Wireless Communication Systems Cordless Telephone System. Cellular Telephone Systems SLE: Comparison of Common Wireless Communications Systems. 6 Hours  UNIT 2 Modern Wireless Communications Systems: Second generation (2G) Cellular Networks evolution of 2.5G TDMA Standards Third Generation (3G) Wireless Networks. SLE: Wireless Local Loop (WLL) and LMDS Wireless Local Area Networks (WLANs) Bluetooth and Personal Area Networks (PANS). 5 Hours  UNIT 3 The Cellular Concept: System Design Fundamentals Introduction Frequency reuse channel assignment strategies handoff strategies – prioritizing handoffs Practical Handoff considerations. Interference and system capacity co-channel interference and system capacity Channel planning for wireless systems. SLE: Adjacent channel interference power control for reducing interference. 7 Hours  UNIT 4 Mobile Radio Propagation: Introduction to radio wave propagation Free space propagation model Relating power to electric field Reflection. SLE: diffraction and scattering 7 Hours    \\\"\",\"\\\"45\\\"\":\"\\\"` UNIT 5  Modulation Techniques for Mobile Radio: Linear Modulation techniques – Binary phases shift keying (BPSK) Differential Phase Shift Keying (DPSK) Quadrature Phase Shift Keying (QPSK) Constant envelope modulation – Binary Frequency Shift Keying Minimum Shift Keying (MSK) Gaussian Minimum Shift Keying (GMSK). SLE: Frequency modulation Vs amplitude modulation Amplitude modulation Angle modulation Digital Modulation. 7 Hours  UNIT 6  Multiple Access Techniques for Wireless Communications: Introduction to Multiple access Frequency Division Multiple Access (FDMA) Time Division Multiple Access (TDMA) Spread Spectrum Multiple Access Space Division Multiple Access (SDMA) Packet Radio. Protocols. Wireless Networking. Introduction to Wireless Networks. Differences Between Wireless and Fixed Telephone Networks. Development of Wireless Networks. SLE: Reservation Protocols–Reservation ALOHA Packet Reservation Multiple Access (PRMA) Capacity of cellular systems. 7 Hours  TEXT BOOKS 1. Wireless Communications Principles and Practice second edition Theodore S Rappaport Pearson Education Asia 2002.  REFERENCE BOOKS 1. Mobile Communications Engineering Theory and Applications Second Edition William C Y Lee McGraw Hill Telecommunications 1998.  2. Wireless Communications and Networks William Stallings Pearson Education Asia 2002.  \\\"\",\"\\\"46\\\"\":\"\\\"` INTRODUCTION TO ANDROID PROGRAMMING (3:0:0)  Sub code : CS0313 CIE : 50 % Hours / week : 03 SEE : 50 % SEE Hours : 3 Hours Max. Marks : 100  Pre-requisite: DBMS Java Programming Course outcomes: On successful completion of the course the students will be able to 1. Understand the basic versions the evolution of Android as a Mobile OS create simple apps and apply different styles. 2. Experiment with the User Interface of Android using Activities Fragments and Intents. 3. Manipulate the UI with different common elements. 4. Apply the knowledge to a real time Android Application in terms of Design and Visualization. 5. Apply the knowledge to a real time Internet Download Application. 6. Able to learn how to persist data using preferences.  UNIT 1 GETTING STARTED WITH ANDROID PROGRAMMING:What Is Android? Android Versions Features of Android Architecture of Android Android Devices in the Market The Android Market The Android Developer Community Obtaining the Required Tools Android SDK Installing the Android SDK Tools Configuring the Android SDK Manager Eclipse Android Development Tools (ADT) Creating Android Virtual Devices (AVDs) Creating Your First Android Application Anatomy of an Android Application. SLE: Designing a Android Application 6 Hours  UNIT 2 ACTIVITIES FRAGMENTS AND INTENTS: Understanding Activities Applying Styles and Themes to an Activity Hiding the Activity Title Displaying a Dialog Window Displaying a Progress Dialog Displaying a More Sophisticated Progress Dialog Linking Activities Using Intents Resolving Intent Filter Collision Returning Results from an Intent Passing Data Using an Intent Object Fragments Adding Fragments Dynamically Life Cycle of a Fragment Interactions between Fragments Calling Built-In Applications Using Intents Understanding the Intent Object Using Intent Filters Adding Categories. SLE: Displaying Notifications in Android Application 7 Hours  UNIT 3 GETTING TO KNOW THE ANDROID USER INTERFACE: Understanding the Components of a Screen Views and View Groups Linear Layout Absolute Layout Table Layout Relative Layout Frame Layout Scroll View Adapting to Display Orientation Anchoring Views Resizing and Repositioning Managing \\\"\",\"\\\"47\\\"\":\"\\\"` Changes to Screen Orientation Persisting State Information during Changes in Configuration Detecting Orientation Changes Controlling the Orientation of the Activity Utilizing the Action Bar Adding Action Items to the Action Bar Customizing the Action Items and Application Icon Creating the User Interface Programmatically Listening for UI Notifications Overriding Methods Defined in an Activity Registering Events for Views. SLE: Designing User Interface 7 Hours  UNIT 4 DESIGNING YOUR USER INTERFACE WITH VIEWS: Using Basic Views TextView View Button ImageButton EditText CheckBox ToggleButton RadioButton and RadioGroup Views ProgressBar View AutoCompleteTextView View Using Picker Views TimePicker View DatePicker View Using List Views to Display Long List ListView View Using the Spinner View Understanding Specialized Fragments Using a ListFragment Using a DialogFragment Using a PreferenceFragment DISPLAYING PICTURES AND MENUS WITH VIEWS: Using Image Views to Display Pictures Gallery and ImageView Views Image Switcher Grid View Using Menus with Views Creating the Helper Methods Options Menu Context Menu Some Additional Views Analog Clock and Digital Clock Views Web View. SLE: Designing Menus in Android 7 Hours   UNIT 5 USING INTERNET RESOURCES: Downloading and Parsing Internet Resources Connecting to an Internet Resource Parsing XML Using the XML Pull Parser Creating an Earthquake Viewer Using the Download Manager Downloading Files Customizing Download Manager Notifications Specifying a Download Location Cancelling and Removing Downloads Querying the Download Manager Using Internet Services Connecting to Google App Engine Best Practices for Downloading Data Without Draining the Battery SLE: Using Internet Resources to develop Android Applications 6 Hours   UNIT 6 FILES SAVING STATE AND PREFERENCES: Saving Simple Application Data Creating and Saving Shared Preferences Retrieving Shared Preferences Creating a Settings Activity for the Earthquake Viewer Introducing the Preference Framework and the Preference Activity Defining a Preference Screen Layout in XML Native Preference Controls Using Intents to Import System Preferences into Preference Screens Introducing the Preference Fragment Defining the Preference Fragment Hierarchy Using Preference Headers Introducing the Preference Activity Backward Compatibility and Preference Screens Finding and Using \\\"\",\"\\\"48\\\"\":\"\\\"` the Shared Preferences Set by Preference Screens Introducing On Shared Preference Change Listeners Creating a Standard Preference Activity for the Earthquake Viewer Persisting the Application Instance State Saving Activity State Using Shared Preferences Saving and Restoring Activity Instance State Using the Lifecycle Handlers Saving and Restoring Fragment Instance State Using the Lifecycle Handlers Including Static Files as Resources Working with the File System File-Management Tools Using Application-Specific Folders to Store Files Creating Private Application Files Using the Application File Cache Storing Publicly Readable File SLE: Creating Private Application Files 6 Hours  TEXT BOOKS: 1. Wei-Meng Lee Beginning Android 4 Application Development Wrox Wiley India Edition. (Chapters: 1 2 3 4 5) 2. Reto Meier Professional Android 4 Application Development Wrox Wiley India Edition(Chapters: 6 7 8)  REFERENCE BOOKS: 1. Mark Murphy The Busy Coder's Guide to Android Development version 4.2. 2. Android Programming: The Big Nerd Ranch Guide (Big Nerd Ranch Guides) 3. Paul Deitel Harvey Deitel Abbey Deitel and Michael Morgano Android for Programmers: An App- Driven Approach 4. Anubhav Pradhan Anil V Deshpande Composing Mobile Apps: Learn / Explore / Apply using Android 1st Edition.  \\\"\",\"\\\"49\\\"\":\"\\\"` BIG DATA ANALYTICS (2:0:2)  Sub code : CS0324 CIE : 50 % Hours / week : 03 SEE : 50 % SEE Hours : 3 Hours Max. Marks : 100  Course Outcome On successful completion of the course the students will be able to 1. Overview of Big Data and Related Technologies 2. Analyze Technologies for Handling Big Data and Hadoop Ecosystem 3. Acquire clear understanding of MapReduce Fundamentals and HBase 4. Acquire clear understanding of Virtualizing and Processing Data using MapReduce 5. Acquire a clear understanding of YARN and Mahout 6. Acquire a clear understanding of Hive  UNIT 1 Getting an Overview of Big Data What is Big Data? History of Data Management – Evolution of Big Data Structuring Big Data Types of Data Elements of Big Data Volume Velocity Variety Veracity Big Data Analytics Advantages of Big Data Analytics Use of Big Data in Social Networking Use of Big Data in Preventing Fraudulent Activities Use of Big Data in Retail Industry. SLE: Future of Big Data in Automation Industry 6 hours UNIT 2 Introducing Technologies for Handling Big Data and Hadoop Ecosystem Distributed and Parallel Computing for Big Data Introducing Hadoop How does Hadoop Function? Cloud Computing and Big Data Features of Cloud Computing Cloud Deployment Models Cloud Delivery Models Cloud Services for Big Data Cloud Providers in Big Data Market In-Memory Computing Technology for Big Data Hadoop Ecosystem Hadoop Distributed File System HDFS Architecture Features of HDFS MapReduce Features of MapReduce Hadoop YARN Introducing HBase Combining HBase and HDFS. SLE:Sqoop Flume 6 hours   UNIT 3 Understanding MapReduce Fundamentals and HBase The MapReduce Framework Exploring the Features of MapReduce Working of MapReduce Exploring Map and Reduce Functions Techniques to Optimize MapReduce Jobs Hardware/Network Topology Synchronization File System Uses of MapReduce Role of HBase in Big Data Processing Characteristics of HBase SLE : Installation of HBase 7 hours UNIT 4 Understanding Big Data Technology Foundations and Processing your Data with MapReduce Exploring the Big Data Stack Virtualization and Big Data Virtualization Approaches Developing a Simple MapReduce Application Points to Consider while designing MapReduce. SLE: Managing Virtualization with Hypervisor 6 hours    \\\"\",\"\\\"50\\\"\":\"\\\"`  UNIT 5 Understanding Hadoop YARN Architecture and Mahout Background of YARN YARN Architecture Working of YARN YARN Schedulers Backward Compatibility with YARN YARN Configurations YARN Commands What is Mahout? Machine Learning Collaborative Filtering Clustering Classification Mahout Algorithms Environment for Mahout. SLE: YARN Containers 7 hours  UNIT 6 Exploring Hive Introducing Hive Hive Services Data Types in Hive Built-In Functions in Hive Hive DDL Data Manipulation in Hive Data Retrieval in Hive Using Joins in Hive. SLE: Getting Started with Hive Installation 7 hours  TEXTBOOK: 1. Big Data: Black Book DT Editorial Services Wiley India Pvt Ltd 2015 Edition  REFERENCE BOOKS: 1. Big Data Analytics with R and Hadoop Vignesh Prajapati -Packt Publishing 2013 2. Michael Minelli Michehe Chambers “Big Data Big Analytics: Emerging Business Intelligence and Analytic Trends for Today’s Business” 1st Edition Ambiga Dhiraj Wiely CIO Series 2013. 3. Bill Franks “Taming the Big Data Tidal Wave: Finding Opportunities in HugeData Streams with Advanced Analytics” 1st Edition Wiley and SAS BusinessSeries 2012. 4. Tom White “Hadoop: The Definitive Guide” 3rd Edition O’reilly 2012. 5. Data Science and Big Data Analytics: Discovering Analyzing Visualizing and Presenting Data EMC Education Services Wiley India Pvt Ltd                 \\\"\",\"\\\"51\\\"\":\"\\\"` INTRODUCTION TO DATA MINING (3:0:0) Sub code : CS0325 CIE : 50% Marks Hrs/week : 03 SEE : 50% Marks SEE Hrs : 03 Hours Max. Marks : 100  Course Outcome On successful completion of the course the students will be able to 1. Understand Data Mining concepts and applications of Data Mining Applications. 2. Discuss Data Preprocessing Techniques. 3. Understand Data Warehouse Implementation. 4. Acquire the knowledge of Data Cube Computation and Data Generalization 5. Acquire clear understanding of Mining Frequent Patterns Associations and Correlations 6. Apply the knowledge of Classification and Prediction in real world applications.  UNIT 1 Introduction to Data Mining: Motivation and importance What is Data Mining Relational Databases Data Warehouses Transactional Databases Advanced Database Systems and Advanced Database Applications Data Mining Functionalities Interestingness of a pattern Classification of Data Mining Systems. SLE: Major issues in Data Mining. 6 Hours  UNIT 2 Data Preprocessing Why Pre-process the Data? Data Cleaning Data Integration and Transformation Data Reduction Discretization. SLE: Concept Hierarchy Generation 6 Hours  UNIT 3 Data Warehouse and OLAP Technology for Data Mining What is a Data Warehouse? Multi- Dimensional Data Model Data Warehouse Architecture Data Warehouse Implementation Development of Data Cube Technology. SLE: Data Warehousing to Data Mining 7 Hours  UNIT 4 Data Cube Computation and Data Generalization: Efficient Methods for Data Cube Computation Further Development of Data Cube and OLAP Technology Attribute-Oriented Induction—An Alternative Method for Data Generalization and Concept Description SLE: Class Description: Presentation of Both Characterization and Comparison 6 Hours \\\"\",\"\\\"52\\\"\":\"\\\"` UNIT 5 Mining Frequent Patterns Associations and Correlations: Basic Concepts and a Road Map Efficient and Scalable Frequent Itemset Mining Methods Mining Various Kinds of Association Rules From Association Mining to Correlation Analysis SLE: Metarule-Guided Mining of Association Rules 7 Hours  UNIT 6 Classification and Prediction: What Is Classification? What Is Prediction? Issues Regarding Classification and Prediction Classification by Decision Tree Induction Bayesian Classification Rule- Based Classification Classification by Backpropagation Support Vector Machines Prediction Accuracy and Error Measures Evaluating the Accuracy of a Classifier or Predictor Model Selection SLE: Ensemble Methods 7 Hours  TEXT BOOK 1. Data Mining Concepts and Techniques Jiawei Han and Micheline Kamber Morgan Kaufman Publications  REFERENCE BOOKS 1. Introduction to Data Mining Adriaan Addison Wesley Publication 2. Data Mining Techniques A.K.Pujari University Press                          \\\"\",\"\\\"53\\\"\":\"\\\"` CLIENT – SERVER PROGRAMMING (3:0:0) Sub code : CS0321 CIE : 50% Marks Hrs/Week : 03 SEE : 50% Marks SEE Hrs : 03 Hours Max.Marks : 50 Course Outcome  On successful completion of the course the students will be able to 1. Illustrate concurrent processing in client- server software and explain two basic approaches to network communication 2. Discuss algorithms and issues in Client Software Design 3. Implement TCP and UDP client for TIME service 4. Discuss algorithms and Issues in Server Software Design 5. Demonstrate Iterative Connectionless and Connection oriented Servers 6. Implement Concurrent Connection-Oriented Servers (TCP)  UNIT-1 The Client Server Model and Software Design: Introduction Motivation Terminology and Concepts. Concurrent Processing in Client-Server software: Introduction Concurrency in Networks Concurrency in Servers Terminology and Concepts An example of Concurrent Process Creation Executing New Code Context Switching and Protocol Software Design Concurrency and Asynchronous I/O. Program Interface to Protocols: Introduction Loosely Specified Protocol Software Interface Interface Functionality Conceptual Interface Specification System Calls Two Basic Approaches to Network Communication The Basic I/O Functions available in UNIX. SLE: Using UNIX I/O with TCP/IP 7 hours  UNIT-2 The Socket Interface: Introduction Berkley Sockets Specifying a Protocol Interface the Socket Abstraction Specifying an End Point Address A Generic Address Structure Major System Calls used with Sockets Utility Routines for Integer Conversion Using Socket Calls in a Program Algorithms and Issues in Client Software Design: Introduction Learning Algorithms instead of Details Client Architecture Identifying the Location of a Server Parsing an Address Argument Looking up a Domain Name Looking up a well-known Port by Name Port Numbers and Network Byte Order Looking up a Protocol by Name The TCP Client Algorithm Allocating a Socket Choosing a Local Protocol Port Number A fundamental Problem in choosing a Local IP Address Connecting a TCP Socket to a Server Communicating with the Server using TCP Reading a response from a TCP Connection Closing a TCP Connection Programming a UDP Client Connected and Unconnected UDP Socket Using Connect with \\\"\",\"\\\"54\\\"\":\"\\\"` UDP Communicating with a Server using UDP Closing a Socket that uses UDP Partial Close for UDP A Warning about UDP Unreliability. SLE: Symbolic Constants for Socket Call Parameters. 7 marks  UNIT-3 Example Client Software: Introduction The Importance of Small Examples Hiding Details An Example Procedure Library for Client Programs Implementation of Connect TCP Implementation of Connect UDP A Procedure that Forms Connections Using the Example Library The DAYTIME Service Implementation of a TCP Client for DAYTIME Reading from a TCP Connection The Time Service Accessing the TIME Service Accurate Times and Network Delays A UDP Client for the TIME Service The ECHO Service. SLE: A TCP Client for the ECHO Service A UDP Client for the ECHO Service. 7 hours  UNIT-4 Algorithm and Issues in Server Software Design: Introduction The Conceptual Server Algorithm Concurrent Vs Iterative Servers Connection-Oriented Vs Connectionless Access Connection-Oriented Servers Connectionless Servers Failure Reliability and Statelessness Optimizing Stateless Servers Four Basic Types of Servers Request Processing Time Iterative Server Algorithms An Iterative Connection-Oriented Server Algorithm Binding to a Well Known Address using INADDR_ANY Placing the Socket in Passive Mode Accepting Connections and using them. An Iterative Connectionless Server Algorithm Forming a Reply Address in a Connectionless Server Concurrent Server Algorithms Master and Slave Processes A Concurrent Connectionless Server Algorithm A concurrent Connection-Oriented Server Algorithm Using separate Programs as Slaves Apparent Concurrency using a Single Process When to use each Server Types The Important Problem of Server Deadlock SLE: Alternative Implementations. 6 hours  UNIT-5 Iterative Connectionless Servers (UDP): Introduction Creating a Passive Socket Process Structure An Example TIME Server. Iterative Connection-Oriented Servers (TCP): Introduction Allocating a Passive TCP Socket A Server for the DAYTIME Service Process Structure An Example DAYTIME Server Closing Connections. SLE: Connection Termination and Server Vulnerability 6 hours  UNIT-6 Concurrent Connection-Oriented Servers (TCP): Introduction Concurrent ECHO Iterative Vs Concurrent Implementations Process Structure An example Concurrent ECHO Server Cleaning up Errant processes Brief introduction to Single process Concurrent Servers (TCP). SLE: Examples on DAYTIME Server (concurrent server TCP) 6 Hours \\\"\",\"\\\"55\\\"\":\"\\\"` TEXT BOOKS: 1. Douglas E.Comer David L. Stevens: Internetworking with TCP/IP – Vol. 3 Client-Server 2. Programming and Applications BSD Socket Version with ANSI C 2nd Edition Pearson 2001.  REFERENCE BOOKS: 1. W. Richard Stevens: Unix Network Programming PHI 2001.2 2. W. Richard Stevens: TCP/IP Illustrated Volumes 1 2 and 3 Pearson 2000  \\\"\",\"\\\"56\\\"\":\"\\\"` WEB PROGRAMMING (2:0:2) Sub code : CS0314 CIE : 50% Marks Hrs/Week : 03 SEE : 50% Marks SEE Hrs : 03 Hours Max. Marks : 50  Course Outcome On successful completion of the course the students will be able to  1. Prepare Web pages using HTML/XHTML 2. Illustrate the application of CSS to the web pages 3. Explain the concepts and constructs of JavaScript 4. Demonstrate events handling in JavaScript 5. Create dynamic web pages using JavaScript 6. Discuss the characteristics and syntactic structure of XML document  Unit-1 Fundamentals: Introduction To The Internet The World Wide Web Web Browsers Web Servers Uniform Resource Locators Multipurpose Internet Mail Extensions The Hypertext Transfer Protocol The Web Programmer’s Toolbox. Introduction To XHTML: Origin And Evolution Of HTML And HTML Basic Syntax Standard XHTML Document Structure Basic Text Markup Images Hypertext Links Lists Tables Forms Frames . SLE: Syntactic Differences between HTML And XHTML 7 hours  UNIT-2 Cascading Style Sheets: Introduction Levels Of Style Sheets Style Specification Formats Selector Forms Property Value Forms Font Properties List Properties Color The Box Model Background Images The <Span> And <Div> Tags Conflict Resolution. SLE: Alignment of text conflict resolution 6 hours  Unit-3 The Basics Of JavaScript: Overview Of JavaScript Object Orientation And JavaScript General Syntactic Characteristics Primitives Operations And Expressions Screen Output And Keyboard Input Control Statements Object Creation And Modification Arrays Functions An Example Constructors Pattern Matching using Regular Expressions Another Example. SLE: Errors in Scripts. 6 marks  \\\"\",\"\\\"57\\\"\":\"\\\"` Unit-4 JavaScript and XHTML Documents: The JavaScript Execution Environment the Document Object Model Element Access in JavaScript Events and Event handling Handling Events from Body Elements Handling events from Button elements DOM 2 Event Model The Navigator object SLE: Handling Events from Text Box and Password Elements DOM tree Traversal and Modification. 7 hours  Unit-5 Dynamic Document with Javascript: Introduction Positioning Elements Moving Elements Elements Element Visibility Changing Colors And Fonts Dynamic Contents Stacking Elements Locating The Mouse Cursors Reacting To A Mouse Click. SLE: Slow Movement of Elements 6 hours  Unit-6 Introduction To XML: Introduction The Syntax Of XML XML Document Structure Document Type Definitions Namespaces XML Schemas Displaying Raw XML Documents Displaying XML Documents With CSS XSLT Style Sheets . SLE: Dragging and Dropping Elements XML Processors Web Services 7 hours  TEXT BOOK 1. Robert W. Sebesta : Programming the World Wide Web 4th Edition Pearson Education \\\"\",\"\\\"58\\\"\":\"\\\"` WIRELESS AND MOBILE NETWORKS (3:0:0)  Sub code: CS0330 CIE: 50% Hrs/ week: 03 SEE : 50% SEE Hrs: 3 Hours Max Marks : 100  Course Outcome: On successful completion of the course the students will be able to 1. Describe an advanced element of learning in the field of wireless communication. 2. Outline the basic concepts of wireless connectivity and mobile computing. 3. Analyze networking principles and fundamental challenges of wireless devices number portability in cellular networks. 4. Have a working understanding of the characteristics and limitations of mobile hardware devices including their user-interface modalities. 5. Gain knowledge about different mobile platforms and application development 6. Understand and analyse how Internet Protocols are used for mobile devices and how they are applied differently compared to static devices. UNIT 1 Introduction to Wireless Communication Systems &Networking: Evolution of Mobile Radio Communication Packet switched and circuit switched systems examples of Wireless Communication Systems Cellular Telephone Systems Principle of Cellular Communication Overview and comparision of AMPS 1G 2G 2.5G and 3G 3.5G and 4G technologies SLE: Comparison of Common Wireless Communications Systems VoLTE usage in India and its difference with normal voice calls. 5 Hours UNIT 2 Mobility and Handoff management: Handoff Mobility management Roaming management Strategies for handoff detection MAHO NCHO MCHO channel assignment radio link transfer hard handoff and soft handoff SLE: Ongoing call termination vs New call blocking – precedence during handoff and implementation issues involved. 7 Hours UNIT 3 Number portability SRF and challenges: Mobile Computing fundamental challenges Mobile Number Portability-types architecture and implementation fixed networks and mobile networks Signaling relay approaches SRF SLE: Mobile number portability in India VoIP service for mobile networks 7 Hours   \\\"\",\"\\\"59\\\"\":\"\\\"` UNIT 4: GSM and GPRS: GSM architecture Location tracking and call setup security GPRS Services and architecture classes of GPRS devices GPRS state model and radio resource and multiple access management sharing of radio channels between voice and data USSD SLE: Phone theft security and its relation with GSM network 7 Hours  UNIT 5: Mobile OS: Mobile Devices –Special Constrains & Requirements – Commercial Mobile Operating Systems Palm OS Win CE(basics) and Android OS architecture Dalvik Virtual Machine working and its differences with JVM SDKs SLE: Wireless local loop (WLL) 7 Hours UNIT 6: Mobile IP and Short message Services:Mobile IP and IP v 6 and its application in mobile computing Triangle routing logicalproblems and optimization SMS Architecture Mobile Originating and Mobile Terminating SMS SMS TPDUs SMS encoding & decoding SLE: WAP protocol stack 6 hours TEXT BOOKS: 1. Yi Bing Lin “Wireless and Mobile Networks Architecture” John Wiley Oct 2 2008 2. Ajay R. Mishra “Cellular Technologies for Emerging Markets: 2G 3G and Beyond” Wiley; 1 edition (August 30 2010)  REFERENCE BOOKS: 1. Nikolay Elenkov “Android Security Internals: An In-Depth Guide to Android's Security Architecture” No Starch Press; 1 edition (November 2 2014) 2. Tomasz Imielinski et.al “Mobile Computing” Kluwer Academic Press 3. Raj Kamal “Mobile Computing” Oxford University Press 2nd edition September 2012  \\\"\",\"\\\"60\\\"\":\"\\\"` PYTHON PROGRAMMING (3:0:0)  Sub Code : CS0315 CIE : 50% Marks Hours/Week : 03 SEE : 50% Marks SEE Hours : 03 Hours Max. Marks : 100  Pre-requisite: Computer Programming Concepts Course Outcomes: On Successful Completion of the Course the students will be able to: 1. Explain core ideology of Python and write simple python programs using numeric types. 2. Use String List and Dictionary types in Python for data storage and processing. 3. Use various python control statements to develop applications. 4. Demonstrate use of advanced function features in Python. 5. Apply OOP features in python. 6. Demonstrate advanced function features and exception handling. UNIT 1: Introduction: Why do people use Python? Who uses Python today? What can I do with Python? What are Python’s technical strengths? Introducing Python Object Types The Python Conceptual Hierarchy Why Use Built-in Types? Python’s Core Data Types. Numeric Types: Numeric Type Basics Numbers in Action Dynamic Typing Interlude Case of the Missing Declaration Statements.  SLE: Shared References. 7 Hours  UNIT 2: String Fundamentals: String Basics String Literals String in Action String Methods. Lists and Dictionaries: Lists Lists in action Dictionaries Dictionaries in action. ‘Tuples-Files and Everything Else’: Tuples Files.  SLE : Sets 7 Hours  UNIT 3: Statements and Syntax: Assignments Expressions and Prints: Assignment Statements-Assignment Statement Forms Sequence Assignments. if Tests and Syntax Rules: if statements while and for Loops: while loops break continue pass and the Loop else. For Loops. SLE: Loop Coding Techniques 6 Hours  UNIT 4: Function Basics: Why Use Functions Coding Functions Examples: Definitions and Calls Intersecting Sequences. Arguments: Argument-Passing Basics Special Argument-Matching Modes: Argument Matching Basics Argument Matching Syntax  SLE:Keyword and Default Examples. 6 Hours  UNIT 5: Classes and OOP: Class Coding Basics: Classes Generate Multiple Instance Objects Classes Are Customized by Inheritance Classes Can Intercept Python Operators The World’s Simplest Python Class Class Coding Details: The class Statement Methods Inheritance Namespaces: The Conclusion.  SLE: User-Defined Exceptions Termination Actions. 7 Hours \\\"\",\"\\\"61\\\"\":\"\\\"`    UNIT 6: Advanced Function Topics: Anonymous Functions-lambda Functional Programming Tools-map Headers: Collecting arguments Calls: Unpacking arguments filter reduce. Exception Basics: Why Use Exceptions? Exceptions: The Short Story Exception Coding Details: The try/except/else Statement The raise Statement  SLE:The try/finally Statement Unified try/except/finally. 6 Hours  TEXT BOOK: 1. Learning Python Mark Lutz O’Reilly Media 5th Ed.  REFERENCE BOOKS: 1. Introducing Python – Modern Computing in Simple Packages Bill Lubanovic O’Reilly Media First Edition. 2. Think Python - How to Think Like a Computer Scientist Allen Downey Green Tea Press 2nd Edition (2.0.17) WEB LINKS: 1. Official Python Documentation: https://docs.python.org 2. Full Stack Python:https://www.fullstackpython.com/   \\\"\",\"\\\"62\\\"\":\"\\\"` OPERATION RESEARCH (3:0:0) Sub Code : CS0311 CIE : 50% Marks Hours/Week : 03 SEE : 50% Marks SEE Hours : 03 Hours Max. Marks : 100 Course Outcome: 1. Understand the need for Operation Research for problem solving and apply the same for linear programming model 2. Analyse and apply Simplex Method for problem solving 3. Understand the fundamental and foundation of Simplex Method. 4. Understand Duality Theory and apply the same for problem solving 5. Explore different application areas of Operation Research like Transportation and Assignment Problems 6. Use the knowledge of Operation Research in Game Theory and Decision Making  UNIT 1 Introduction: The origin nature and impact of OR; Defining the problem and gathering data; Formulating a mathematical model; Deriving solutions from the model; Testing the model; Preparing to apply the model; Implementation. Introduction to Linear Programming: Prototype example; The linear programming (LP) model SLE: Assumptions of LP. 7 hrs  UNIT 2 Simplex Method - I: The essence of the simplex method; Setting up the simplex method; Algebra of the simplex method; the simplex method in tabular form. SLE: Tie breaking in the simplex method 6 hrs  UNIT 3 Simplex Method – I: Adapting to other model forms Simplex Method – II: Foundation of simplex method the revised simplex method a fundamental insight  SLE: Simplex method in Matrix form 6 hrs UNIT 4: Duality Theory: The essence of duality theory; Economic interpretation of duality Primal dual relationship; Adapting to other primal forms. SLE: SOB Method 6 hrs   \\\"\",\"\\\"63\\\"\":\"\\\"` UNIT 5 Transportation and Assignment Problems: The transportation problem A streamlined simplex method for the transportation problem; The assignment problem. SLE: Travelling Salesmen Problem 7 hrs  UNIT 6 Game Theory: The formulation of two persons zero sum games; Solving simple games- a prototype example; Games with mixed strategies. Decision Analysis: A prototype example; Decision making without experimentation. Decision making with experimentation SLE: Decision tree. 7 hrs  TEXT BOOK: 1. Frederick S. Hiller and Gerald J. Lieberman: Introduction to Operations Research: Concepts and Cases 9th Edition Tata McGraw Hill 2010  REFERENCE BOOK: 1. Wayne L. Winston: Operations Research Applications and Algorithms 4th Edition Cengage Learning 2003        \\\"\",\"\\\"64\\\"\":\"\\\"`  ADVANCED JAVA (3:0:0) Sub Code : CS0316 CIE : 50% Marks Hours/Week : 03 SEE : 50% Marks SEE Hours : 03 Hours Max. Marks : 100  Course Outcome On successful completion of the course the students will be able to 1. Demonstrate the usage of Applet class and its interfaces. 2. Illustrate the main event classes and interfaces used by the AWT along with Creation management of windows fonts output text and utilize graphics. 3. Discuss standard AWT controls and layout managers 4. Explain the flexibility of GUI components of Swing compare to AWT 5. Discuss building complex systems from software components using Beans and how servlets dynamically extend the functionality of a web server 6. Demonstrate JDBC connectivity to Databases Unit-1 Applet: The Applet Class Two Types of Applets Applet Basics The Applet Class Applet Architecture An Applet Skeleton Applet Initialization and Termination Overriding update( ) Contents Simple Applet Display Methods . Requesting Repainting A Simple Banner Applet Using the Status Window The HTML APPLET Tag Passing Parameters to Applets Improving the Banner Applet getDocumentBase( ) and getCodeBase( ) AppletContext and showDocument( ) Outputting to the Console. SLE:The AudioClip Interface TheAppletStub Interface 6 hours  Unit-2 Event handling in Java:Two Event Handling Mechanisms The Delegation Event Model Events classes source of events events listener interfaces Using the Delegation Event Model Adapter Classes.  Introduction to AWT: AWT classes Windows Fundamental Working With Frame Windows Creating A Frame Window In An Applet Creating A Windowed Program Displaying Information With In A Window Working With Graphics Colors Fonts Setting The Paint Mode SLE: Inner Classes Managing text output using FontMetric 8 hours   Unit-3 Using AWT Controls Layout Manager and Menus:Control Fundamentals Labels Using Buttons Checkboxes Checkbox Group Choice Controls Using Lists Managing Scroll Bars Using Text field Text area Understanding Layout Managers Menu bars And Menus Dialog Boxes. SLE: File Dialog 6 hours  Unit-4 Swing: Introduction To Swing Origin Of Swing Swing Is Built On The AWT Two Key Swing Features The MVC Connection Components And Container Swing Package Event Handling Create A Swing Applet Painting. \\\"\",\"\\\"65\\\"\":\"\\\"` Exploring Swing: Jlabel&Imageicon Jtextfield The Swing Buttons Jtabbedpane Jcrollpane Jlist Jcombobox . SLE: trees Jtable 6 hours  Unit-5 JavaBeans: What Is JavaBeans Advantages Of JavaBeans Introspection Bound And Constrained Properties Persistence Customizers The API Introducing Servlets: Background Life cycle of Servlet Using Tomcat A simple Servlet program API javax.servlet package handling HTTP Request and Response using cookies SLE: Beans example Session Tracking 7 hours  Unit-6 JDBC-connectivity to Database: Java Database Connectivity Database Servers Database Clients JDBC (Java Database Connectivity) Working With Oracle Database Working With MysqlDatabase Stages in a JDBC Program Registering The Driver Connecting To A Database Preparing SQL Statements Using JDBC-ODBC Bridge Driver to connect To Oracle Database Retrieving Data From MysqlDatabase retrieving Data From MS Access Database Improving The Performance of a JDBC Program Affectof Driver Affectof Set fetchsize() AffectOf Prepared statement Stored Procedures and Callable statement Types of Result Sets Storing Images Into Database Retrieving Images from Database Storing a file into Database Retrieving a File from the Database. SLE: Resultsetmetadata Databasemetadata Types of JDBC Drivers 6 hours  TEXT BOOKS 1. Java The Complete Reference Herbert Schildt 9th Edition Tata-McGraw-Hill 2014 2. Core JAVA An Integrated Approach by Dr.R.Nageswara Rao Dreamtech Press 2008  \\\"\",\"\\\"66\\\"\":\"\\\"` ADVANCED ALGORITHMS (3:0:0)      Prerequisite: Analysis and Design of Algorithms. Course Outcome: On successful completion of the course the students will be able to 1. Describe Hashing Technique and Red Black Trees 2. Design algorithm using Dynamic programming and Greedy 3. Compare different algorithms fusing Amortized Analysis 4. Describe B trees and Fibonacci heaps 5. Interpret max flow and multi-threaded algorithm 6. Interpret number-theoretic algorithms  UNIT 1 Hash tables: Direct-address tables Hash tables Hash functions open addressing Red Black Trees: Properties Rotations SLE: Hash Search and Deletion of Red Black Trees. 6 Hours  UNIT 2 Dynamic Programming: Rod Cutting Longest Common Subsequence. Greedy Algorithms: Activity selection problem Huffman codes SLE: a task scheduling problem as a matroid. 6 Hours  UNIT 3 Amortized Analysis: Aggregate analysis The accounting method. Single Source Shortest paths :The Bellman-Ford algorithm. SLE: Single source shortest paths in a DAG. 7 Hours  UNIT 4 B-trees: Introduction Definition of B-trees Basic operations of B-trees. Fibonacci Heaps: Introduction Structure of Fibonacci heaps SLE: Deleting a key from a B-tree. 7 Hours   Sub code : CS0323 CIE : 50 %Marks Hrs / week : 03 SEE : 50 %Marks SEE Hrs : 03 Hours Max. Marks : 100 \\\"\",\"\\\"67\\\"\":\"\\\"` UNIT 5 Maximum Flow: Introduction Flow networks the Ford-Fulkerson method Maximum bipartite matching push reliable algorithms: basic operations push operation reliable operation the generic algorithm. Multi threaded algorithms :the basics of dynamic multithreading. SLE: multi threaded matrix multiplication. 7 Hours  UNIT 6 Number-Theoretic Algorithms :Modular arithmetic Solving modular linear equations The Chinese remainder theorem Powers of an element. String matching algorithms :The Robin Karp algorithm. SLE: string matching with finite automata. 6 Hours  TEXT BOOK: 1. Introduction to Algorithms –Thomas H. Cormen Charles E. Leiserson Ronald L.Rivest Clifford Stein PHI 3rd Edition.  REFERENCE BOOKS: 1. Computer Algorithms- Ellis Horowitz SartajSahni and SanguthevarRajasekaran ComputerScience Press 1998 2. The Design and Analysis of Computer Algorithms- Alfred V. Aho John E. Hopcroft Jeffrey D. Ullman Addison Wesley 1974.  \\\"\",\"\\\"68\\\"\":\"\\\"` DECISION SUPPORT SYSTEM (3:0:0)  Sub Code CS0304 CIE:50% Marks Hrs/ Week: 3 SEE: 50% Marks SEE Hrs: 03 Max. Marks: 100  Course Outcome:  On successful completion of the course the students will be able to  1. Explain the use of Computers in Decision support systems and its various applications 2. Develop decisions based on intelligence 3. Illustrate DSS and its components of DSS 4. Develop Mathematical models and set goals for the decision. 5. Develop DSS by using various tools techniques and methods. 6. Compare Enterprise decision support systems and Knowledge Management  Unit 1 DECISION-MAKING AND COMPUTERIZED SUPPORT: Management Support Systems: An Overview Managers. and Decision-Making Managerial Decision-Making and Information Systems Managers and Computer Support Computerized Decision Support and the Supporting Technologies A Framework for Decision Support The Concept of Decision Support Systems Group Support Systems Enterprise Information Systems Knowledge Management Systems Expert Systems Artificial Neural Networks Advanced Intelligent Decision Support Systems SLE: Hybrid Support Systems ABE Automation Makes Faster and Better Decisions with DSS 6 Hrs  Unit - 2 Decision-Making Systems Decision-Making: Introduction and Definitions Systems Models Phases ofthe Decision-Making Process Decision-Making: The Intelligence Phase Decision-Making: The Design Phase Decision-Making:The Choice Phase Decision-Making: The Implementation Phase How Decisions Are Supported Personality Types Gender Human CognitiorI and Decision Styles The Decision-Makers SLE : Clay Process Planning at IMERYS: A Classical Caseof Decision-Making 7 Hrs  Unit - 3 Decision Support Systems: DSS Configurations What Is a DSS? Characteristics and Capabilities of DSS Components of DSS The Data Management Subsystem The Model Management Subsystem The User Interface (Dialog) Subsystem The Knowledge-Based Management Subsystem The User DSS Hardware DSS Classifications. Modeliug and Analysis: MSS Modeling Static and Dynamic Models Certainty Uncertainty and Risk Influence Diagrams MSS Modeling with Spreadsheets Decision Analysis of a Few Alternatives (Decision Tables and Decision Trees) SLE: The Advantage of Petro Vantage: Business IntelligencelDSS Creates an E-Marketplace 7 Hrs  Unit - 4 Mathematical Modelling: The Structure of MSS Mathematical Models athematical Programming Optimization Multiple Goals Sensitivity Analysis What-If and Goal Seeking Problem-Solving Search Methods Heuristic Programming Simulation Visual Interactive Modeling and Visual Interactive Simulation Business Intelligence: Data Warehousing Data Acquisition Data Mining BusinessAnalytics and Visualization: The Nature and Sources of Data Data Collection Problems and Quality The Web / Internet and Commercial Database Services. SLE: Quantitative Software Packages Model Base Management Database Management Systems in Decision Support Systems / Business Intelligence 7 Hrs  \\\"\",\"\\\"69\\\"\":\"\\\"` Unit - 5 Decision Support System Development: Introduction to DSS Development The Traditional System Development Life Cycle Alternative Development Methodologies Proto typing: The DSS Development Methodology Change Management DSS Technology Levels and Tools DSS Development Platforms DSS Development Tool Selection Team-Developed DSS. SLE: End User Developed DSS Putting The DSS Together 6 Hrs   Unit - 6 COLLABORATION COMMUNICATION ENTERPRISE DECISION SUPPORT SYSTEMS AND KNOWLEDGE MANAGEMENT: Collaborative Computing Technologies: Group Support Systems Group Decision-Making Communication and Collaboration Communication Support Collaboration Support: Computer-Supported Cooperative Work Group Support Systems Group Support Systems Technologies Groupsystems Meetingroom and Online The GSS Meeting Process. SLE: Distance Learning Creativity and Idea Generation 7 Hrs   TEXT BOOK: 1. Decision Support Systems and Intelligent Systems - Efraim Turban. Jay E. Aronson Ting Peng Liang: 7th Edition Prentice-Hall of India 2006.  REFERENCE BOOKS 1. Frada Burstein Clyde W. Holsapple International Handbooks Information System Handbook on decision support systems 1: Basic Themes First edition ISBN 3540487123 9783540487128 9783540487135 Springer-Verlag Berlin Heidelberg publisher 2008  2. Vicki L. Sauter Decision Support Systems for Business Intelligence 2nd edition ISBN 0470433744 9780470433744 Wiley publication 2011 \\\"\",\"\\\"70\\\"\":\"\\\"` PERVASIVE COMPUTING (3:0:0)  Sub Code : CS0303 CIE : 50% Marks Hours/Week : 03 SEE : 50% Marks SEE Hours : 03 Hours Max. Marks : 100  Course outcomes: On successful completion of the course the students will be able to 1. Discuss the different applications that use pervasive computing and also compare the different device technology available. 2. Assess the different device connectivity using the protocols 3. Use the voice technology in the hand held devices 4. Design and demonstrate some applications using the programming languages 5. Create the user interfaces for a given application 6. Apply the concepts to PDA and to compare the connected devices  UNIT 1 Past present future: The vine and fig tree dream Pervasive computing the pervasive computing market m-Business Conclusions and challenges. Email access via WAP and voice. Device technology: Hardware Human-machine interfaces Biometrics Operating systems Java for pervasive devices SLE: Application examples: Airline check-in and booking 7 Hours  UNIT 2 Device connectivity: Protocols Security Device management. WAP and beyond: Introduction Components of the WAP architecture WAP infrastructure WAP security issues i-Mode SCCCC SLE: Wireless Markup Language WAP push Products 7 Hours  UNIT 3 Voice technology: Basics of speech recognition Voice standards Speech applications Speech and pervasive computing Security. Personal digital assistants: History Device categories . SLE: Personal digital assistant operating systems 6 Hours     \\\"\",\"\\\"71\\\"\":\"\\\"` UNIT 4 Server-side programming in Java: Java 2 Enterprise Edition: overview Servlets Enterprise Java Beans Java Server pages Web services Model-view-controller pattern SLE: Extensible Markup Language 6 Hours  UNIT 5 Example application: Introduction Architecture Implementation Access from PCs: Smart-card-based authentication via the Internet. Access via WAP: WAP functionality. SLE: User interfaces overview implementation 7 Hours  UNIT 6 Access from personal digital assistants: Extending the example application to personal digital assistants Implementation for connected devices. SLE: Comparison of PDAs connected devices and different implementations 6 Hours  TEXT BOOK 1. Pervasive Computing: Technology and Architecture of Mobile Internet Applications Jochen Burkhardt Thomas Schaeck Horst Henn Stefan Hepper Klaus Rindtorff Pearson Education April 2002.  REFERENCE BOOK 1. Pervasive Computing: the mobile world Uwe Hansmann springer 2nd edition 2003  \\\"\",\"\\\"72\\\"\":\"\\\"` CONCURRENT PROGRAMMING (3:0:0)  Sub code : CS0319 CIE : 50 %Marks Hrs / week : 03 SEE : 50 %Marks SEE Hrs : 03 Hours Max. Marks : 100  Course Outcome On successful completion of the course the students will be able to 1. Illustrate sequential programming paradigm and concurrent programming model with an example. Acquainted with Pascal-FC compiler. 2. Demonstrate process life cycle and process scheduling and how it is handled in Pascal-FC 3. Discuss various ways of process synchronization such as message passing model mutual exclusion shared variables. 4. Explain in detail message passing model and remote invocation. 5. Discuss semaphores - a synchronization primitive. 6. Point Out the advanced synchronization constructs such as critical regions and Monitors. Also analyze concurrency architecture in embedded systems.  UNIT 1 The Nature and Uses of Concurrent Programming: Introduction Sequential Programming asa total ordering Breaking away from the sequential paradigm Concurrent programming as a partial ordering The motivation for concurrent programming An inherently concurrent problem domain Problems in concurrent programming SLE: Introducing Pascal-FC 6 Hours  UNIT 2 Process Representation and Life-cycle: The concept of process Process Structures Process states and transitions Process management and the run-time support system SLE: Timing in Pascal-FC 6 Hours     \\\"\",\"\\\"73\\\"\":\"\\\"` UNIT 3 Process interaction: Active and passive entities The Ornamental Gardens Problem Mutualexclusion and other synchronizations Synchronization using simple shared variables Synchronization primitives for shared variable solutions. SLE: The correctness of concurrent programs 7 Hours  UNIT 4 Synchronous Message-passing: Alternative Language models Selective waiting Communication by channel The select construct Concurrency and non-determinism Remote Invocation: Basic model SLE: Remote invocation and selective waiting 7 Hours  UNIT 5 Semaphores: Definition of semaphores Pascal-FC’s Semaphores Mutual exclusion with semaphore Fairness and semaphores Semaphore invariants Condition synchronization with semaphores SLE: Why Semaphores? Evaluation of semaphores 6 Hours  UNIT 6 Conditional Critical Regions and Monitors: Beyond semaphores Critical regions Conditional critical regions Monitors for mutual exclusion Condition synchronization with monitors Illustrative examples of the use of monitors SLE: Concurrency Architectures: Introduction Embedded systems architecture 7 Hours  TEXT BOOK: 1. Concurrent Programming: Alan Burns Geoffrey Davis Addison-Wesley (1993).  REFERENCE BOOKS: 1. Concurrent Programming – Principles and Practice: Gregory R. Andrews The Benjamin/Cummings Publishing Company Inc (1991). 2. Concurrent Programming: (Edited by) NarainGehani Andrew D. McGettrick Addison Wesley (1988). 3. Principles of Concurrent Programming: M. Ben-Ari Prentice-Hall (1982). 4. Concurrent Programming: C. R. Snow Cambridge University Press (1992). 5. On Concurrent Programming: Fred B. Schneider Springer 1stEdition (1997)    \\\"\",\"\\\"74\\\"\":\"\\\"` PARALLEL ALGORITHMS (3:0:0)         Course Outcome:  On successful completion of the course the students will be able to  1. Compute models such as RAM PRAM were discussed. 2. Discuss parallel algorithms for well-known problems such as prefix computation max sum subsequence array packing. 3. Discuss pointer jumping and divide conquer techniques for parallel programming with examples such as list ranking merge sort. 4. Discuss parallel algorithms for geometrical problems such as convex hull All nearest neighbour. 5. Explain graph theory classic problems such as Euler tour finding connected components shortest path were explained and parallel solutions. 6. Explain Number theory problems such as primarily test GCD and numerical problems such as approximation of Taylor series.  UNIT 1 Models of Computation: RAM (Random Access Machine) PRAM (Parallel Random Access Machine) Fundamental Terminology Interconnection Networks. SLE: Additional Terminology. 7 Hours  UNIT 2 Parallel Prefix: Parallel Prefix Application: Maximum Sum Subsequence Array Packing. SLE: Computing Overlapping Line Segments. 6 Hours  UNIT 3 Pointer Jumping and divide and Conquer: List Ranking Linked List Parallel Prefix Merge Sort (Revisited) Selection. SLE: Modifications of Quick Sort for Parallel Models. 6 Hours  UNIT 4 Computational Geometry: Convex Hull Smallest Enclosing Box Architecture-Independent Algorithm. SLE: All-Nearest Neighbour Problem 7 Hours  UNIT 5 Graph Algorithms: Fundamental PRAM Graph Techniques List Ranking via Pointer Jumping Euler Tour Technique Tree Contraction. SLE: Shortest-Path Problems RAM PRAM and Mesh. 6 Hours   Sub code : CS0306 CIE : 50 %Marks Hrs / week : 03 SEE : 50 %Marks SEE Hrs : 03 Hours Max. Marks : 100 \\\"\",\"\\\"75\\\"\":\"\\\"` UNIT 6 Numerical Problems: Primality Greatest Common Divisor Lame’s Theorem Integral Powers Approximation by Taylor Series. SLE: Evaluating a Polynomial. 7 Hours  TEXT BOOK  1. Algorithms Sequential and Parallel: A Unified Approach Second Edition 2005 By: RussMiller; Laurence Boxer Course Technology PTR.  REFERENCE BOOKS  2. Introduction to Parallel Algorithms Joseph JaJa University of Maryland Addison-Wesley Professional. 3. Parallel Algorithms (Hardcover) by Henri Casanova Arnaud Legrand Yves Robert Publisher: Taylor & Francis /b S Publication (Jul 2008) \\\"\",\"\\\"76\\\"\":\"\\\"` UNIX SYSTEM PROGRAMMING (2:0:2)  Sub code : CS0322 CIE : 50 % Hrs / week : 3 SEE : 50 % SEE Hrs : 03 Hours Max. Marks : 100  Prerequisite: Computer Concepts Course Outcome On successful completion of the course the students will be able to 1. Describe basic features and file I/O functions of UNIX operating system. 2. Explain various aspects of files and directories in UNIX 3. Explain about process environment and process control in UNIX. 4. Illustrate concepts and uses of signals in UNIX. 5. Apply thread concepts and POSIX thread functions for multi-threaded programming in UNIX. 6. Use inter-process communication mechanisms in UNIX for achieving process interaction.  UNIT 1 UNIX System Overview: Introduction Unix architecture System calls and Library Functions. File I/O Introduction File Descriptors open Function creat Function close Function lseek Function read Function write Function File Sharing Atomic Operations dup and dup2. SLE: UNIX Standardization UNIX System Implementations 7 Hours  UNIT 2 Files and Directories Introduction stat Set-User-ID and Set-Group-ID access Function umask Function chmodFunctions Sticky Bit chown Functions File Size File Truncation File Systems link unlink remove and rename Functions Symbolic Links symlink Functions File Times utime Function. SLE: File Types File Access Permissions 7 Hours  UNIT 3 Process Environment Introduction main Function Process Termination Command-Line Arguments Environment List Memory Layout of a C Program Shared Libraries Memory Allocation Environment Variables setjmp and longjmp Functions Process Control Introduction Process Identifiers fork Function vfork Function exit Functions wait and waitpid Functions. SLE: Race Conditions exec Functions Changing User IDs and Group IDs. 7 Hours  \\\"\",\"\\\"77\\\"\":\"\\\"`  UNIT 4 Signals Introduction Signal Concepts signal Function Reentrant Functions Reliable Signal Terminology and Semantics kill and raise Functions alarm and pause Functions sigprocmask Function sigpending Function sigaction Function sigsetjmp and siglongjmp Functions sigsuspend Function. SLE: Unreliable signals Interrupted System calls 6 Hours  UNIT 5 Threads: Introduction Thread Concepts Thread Identification Thread Creation Thread Termination Thread Synchronization. Daemon Processes: Introduction Daemon Characteristics Coding Rules SLE: Single-Instance Daemons Daemon Conventions. 6 Hours  UNIT 6 Interprocess Communication: Introduction Pipes popen and pclose Functions Coprocesses FIFOs XSI IPC Message Queues Semaphores Network IPC: Sockets Introduction Socket Descriptors Addressing Connection Establishment. SLE: Data Transfer Socket Options 6 Hours   TEXT BOOK 1. Advanced Programming in the UNIX Environment – W. Richard Stevens and Stephen A Rago 2nd Edition Pearson Education / PHI 2005.  REFERENCE BOOK 1. The Design of the UNIX Operating System – Maurice J Bach Pearson Education PHI 1987.  \\\"\"}"}}